<?php

use yii\db\Schema;
use yii\db\Migration;
use yii\db\Query;


class m150407_135602_populate_chapter8_option_table extends Migration
{
    public function up()
    {
        $this->insert('option', [
            'id' => '861',
            'name' => "Расположении территорий и объектов, где действуют специальные правила.",
            'num' => '1',
            'question_id' => '249',
        ]);
        $this->insert('option', [
            'id' => '862',
            'name' => "Расположении объектов обслуживания.",
            'num' => '2',
            'question_id' => '249',
        ]);
        $this->insert('option', [
            'id' => '863',
            'name' => "Всем перечисленном выше.",
            'num' => '3',
            'question_id' => '249',
        ]);
        $this->insert('option', [
            'id' => '864',
            'name' => "Не обязан, если имеется другой путь объезда места дорожно-транспортного происшествия.",
            'num' => '1',
            'question_id' => '250',
        ]);
        $this->insert('option', [
            'id' => '865',
            'name' => "Обязан.",
            'num' => '2',
            'question_id' => '250',
        ]);
        $this->insert('option', [
            'id' => '866',
            'name' => "Вам разрешается только налево, пешеходам — в направлении “Б\"",
            'num' => '1',
            'question_id' => '251',
        ]);
        $this->insert('option', [
            'id' => '867',
            'name' => "Вам разрешается во всех направлениях, пешеходам — в направлении “Б\".",
            'num' => '2',
            'question_id' => '251',
        ]);
        $this->insert('option', [
            'id' => '868',
            'name' => "Вам разрешается во всех направлениях, пешеходам — запрещается.",
            'num' => '3',
            'question_id' => '251',
        ]);
        $this->insert('option', [
            'id' => '869',
            'name' => "Вам разрешается прямо или налево, пешеходам — запрещается.",
            'num' => '4',
            'question_id' => '251',
        ]);
        $this->insert('option', [
            'id' => '870',
            'name' => "Вам запрещается, пешеходам разрешается в изображенных стрелками направлениях.",
            'num' => '5',
            'question_id' => '251',
        ]);
        $this->insert('option', [
            'id' => '871',
            'name' => "Водитель микроавтобуса.",
            'num' => '1',
            'question_id' => '252',
        ]);
        $this->insert('option', [
            'id' => '872',
            'name' => "Водитель трамвая.",
            'num' => '2',
            'question_id' => '252',
        ]);
        $this->insert('option', [
            'id' => '873',
            'name' => "Зеленого и синего легковых автомобилей.",
            'num' => '1',
            'question_id' => '253',
        ]);
        $this->insert('option', [
            'id' => '874',
            'name' => "Грузового автомобиля и зеленого легкового автомобиля.",
            'num' => '2',
            'question_id' => '253',
        ]);
        $this->insert('option', [
            'id' => '875',
            'name' => "Белого автомобиля и микроавтобуса.",
            'num' => '3',
            'question_id' => '253',
        ]);
        $this->insert('option', [
            'id' => '876',
            'name' => "Только грузового автомобиля.",
            'num' => '4',
            'question_id' => '253',
        ]);
        $this->insert('option', [
            'id' => '877',
            'name' => "На левом.",
            'num' => '1',
            'question_id' => '254',
        ]);
        $this->insert('option', [
            'id' => '878',
            'name' => "На правом.",
            'num' => '2',
            'question_id' => '254',
        ]);
        $this->insert('option', [
            'id' => '879',
            'name' => "На обоих.",
            'num' => '3',
            'question_id' => '254',
        ]);
        $this->insert('option', [
            'id' => '880',
            'name' => "Разрешается вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '255',
        ]);
        $this->insert('option', [
            'id' => '881',
            'name' => "Разрешается вам налево или на разворот, водителю трамвая — только налево.",
            'num' => '2',
            'question_id' => '255',
        ]);
        $this->insert('option', [
            'id' => '882',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '3',
            'question_id' => '255',
        ]);
        $this->insert('option', [
            'id' => '883',
            'name' => "Разрешается продолжить движение при невозможности остановить его без экстренного торможения, обеспечив при этом безопасность движения.",
            'num' => '1',
            'question_id' => '256',
        ]);
        $this->insert('option', [
            'id' => '884',
            'name' => "Необходимо немедленно остановить автомобиль.",
            'num' => '2',
            'question_id' => '256',
        ]);
        $this->insert('option', [
            'id' => '885',
            'name' => "Только первого.",
            'num' => '1',
            'question_id' => '257',
        ]);
        $this->insert('option', [
            'id' => '886',
            'name' => "Только второго.",
            'num' => '2',
            'question_id' => '257',
        ]);
        $this->insert('option', [
            'id' => '887',
            'name' => "Только третьего.",
            'num' => '3',
            'question_id' => '257',
        ]);
        $this->insert('option', [
            'id' => '888',
            'name' => "Первого и третьего.",
            'num' => '4',
            'question_id' => '257',
        ]);
        $this->insert('option', [
            'id' => '889',
            'name' => "Всех изображенных.",
            'num' => '5',
            'question_id' => '257',
        ]);
        $this->insert('option', [
            'id' => '890',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '258',
        ]);
        $this->insert('option', [
            'id' => '891',
            'name' => "Разрешается прямо или направо.",
            'num' => '2',
            'question_id' => '258',
        ]);
        $this->insert('option', [
            'id' => '892',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '258',
        ]);
        $this->insert('option', [
            'id' => '893',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '258',
        ]);
        $this->insert('option', [
            'id' => '894',
            'name' => "Разрешенной скорости движения.",
            'num' => '1',
            'question_id' => '259',
        ]);
        $this->insert('option', [
            'id' => '895',
            'name' => "Времени, оставшемся до конца горения зеленого сигнала.",
            'num' => '2',
            'question_id' => '259',
        ]);
        $this->insert('option', [
            'id' => '896',
            'name' => "Времени, оставшемся до включения красного сигнала светофора.",
            'num' => '3',
            'question_id' => '259',
        ]);
        $this->insert('option', [
            'id' => '897',
            'name' => "Вам и водителю встречного автомобиля.",
            'num' => '1',
            'question_id' => '260',
        ]);
        $this->insert('option', [
            'id' => '898',
            'name' => "Водителю грузового автомобиля и микроавтобуса.",
            'num' => '2',
            'question_id' => '260',
        ]);
        $this->insert('option', [
            'id' => '899',
            'name' => "Только водителю микроавтобуса.",
            'num' => '3',
            'question_id' => '260',
        ]);
        $this->insert('option', [
            'id' => '900',
            'name' => "Запрещает.",
            'num' => '1',
            'question_id' => '261',
        ]);
        $this->insert('option', [
            'id' => '901',
            'name' => "Разрешает, но это предупреждает водителей о необходимости убедиться в отсутствии приближающегося поезда.",
            'num' => '2',
            'question_id' => '261',
        ]);
        $this->insert('option', [
            'id' => '902',
            'name' => "Разрешает, и водитель имеет преимущество в движении.",
            'num' => '3',
            'question_id' => '261',
        ]);
        $this->insert('option', [
            'id' => '903',
            'name' => "Вам, уступив дорогу легковому автомобилю.",
            'num' => '1',
            'question_id' => '262',
        ]);
        $this->insert('option', [
            'id' => '904',
            'name' => "Только Вам.",
            'num' => '2',
            'question_id' => '262',
        ]);
        $this->insert('option', [
            'id' => '905',
            'name' => "Только водителю легкового автомобиля.",
            'num' => '3',
            'question_id' => '262',
        ]);
        $this->insert('option', [
            'id' => '906',
            'name' => "Разрешают и информируют о наличии опасного пешеходного перехода.",
            'num' => '1',
            'question_id' => '263',
        ]);
        $this->insert('option', [
            'id' => '907',
            'name' => "Запрещают и информируют о наличии пешеходов на переходе.",
            'num' => '2',
            'question_id' => '263',
        ]);
        $this->insert('option', [
            'id' => '908',
            'name' => "Запрещают и предупреждают о необходимости остановки перед переходом.",
            'num' => '3',
            'question_id' => '263',
        ]);
        $this->insert('option', [
            'id' => '909',
            'name' => "Трамваю и автобусу.",
            'num' => '1',
            'question_id' => '264',
        ]);
        $this->insert('option', [
            'id' => '910',
            'name' => "Грузовому автомобилю и трамваю.",
            'num' => '2',
            'question_id' => '264',
        ]);
        $this->insert('option', [
            'id' => '911',
            'name' => "Только автобусу.",
            'num' => '3',
            'question_id' => '264',
        ]);
        $this->insert('option', [
            'id' => '912',
            'name' => "Только трамваю.",
            'num' => '4',
            'question_id' => '264',
        ]);
        $this->insert('option', [
            'id' => '913',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '265',
        ]);
        $this->insert('option', [
            'id' => '914',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '265',
        ]);
        $this->insert('option', [
            'id' => '915',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '265',
        ]);
        $this->insert('option', [
            'id' => '916',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '265',
        ]);
        $this->insert('option', [
            'id' => '917',
            'name' => "Только красному автомобилю.",
            'num' => '1',
            'question_id' => '266',
        ]);
        $this->insert('option', [
            'id' => '918',
            'name' => "Только зеленому автомобилю.",
            'num' => '2',
            'question_id' => '266',
        ]);
        $this->insert('option', [
            'id' => '919',
            'name' => "Только трамваю.",
            'num' => '3',
            'question_id' => '266',
        ]);
        $this->insert('option', [
            'id' => '920',
            'name' => "Трамваю и красному автомобилю.",
            'num' => '4',
            'question_id' => '266',
        ]);
        $this->insert('option', [
            'id' => '921',
            'name' => "На легковом автомобиле только с правой стороны",
            'num' => '1',
            'question_id' => '267',
        ]);
        $this->insert('option', [
            'id' => '922',
            'name' => "На грузовом автомобиле только с левой стороны.",
            'num' => '2',
            'question_id' => '267',
        ]);
        $this->insert('option', [
            'id' => '923',
            'name' => "С правой или левой стороны на любом транспортном средстве.",
            'num' => '3',
            'question_id' => '267',
        ]);
        $this->insert('option', [
            'id' => '924',
            'name' => "Разрешается вам и водителю трамвая прямо или направо.",
            'num' => '1',
            'question_id' => '268',
        ]);
        $this->insert('option', [
            'id' => '925',
            'name' => "Разрешается вам и водителю трамвая только направо.",
            'num' => '2',
            'question_id' => '268',
        ]);
        $this->insert('option', [
            'id' => '926',
            'name' => "Разрешается вам только направо, водителю трамвая — прямо или направо.",
            'num' => '3',
            'question_id' => '268',
        ]);
        $this->insert('option', [
            'id' => '927',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '268',
        ]);
        $this->insert('option', [
            'id' => '928',
            'name' => "Только \"А\".",
            'num' => '1',
            'question_id' => '269',
        ]);
        $this->insert('option', [
            'id' => '929',
            'name' => "Только \"Б\".",
            'num' => '2',
            'question_id' => '269',
        ]);
        $this->insert('option', [
            'id' => '930',
            'name' => "По любому.",
            'num' => '3',
            'question_id' => '269',
        ]);
        $this->insert('option', [
            'id' => '931',
            'name' => "Вам разрешается прямо или направо, пешеходам - в направлении Б",
            'num' => '1',
            'question_id' => '270',
        ]);
        $this->insert('option', [
            'id' => '932',
            'name' => "Вам разрешается прямо или направо, пешеходам - в направлении А и Б",
            'num' => '2',
            'question_id' => '270',
        ]);
        $this->insert('option', [
            'id' => '933',
            'name' => "Вам запрещается, пешеходам разрешается во всех изображенных стрелками направлениях.",
            'num' => '3',
            'question_id' => '270',
        ]);
        $this->insert('option', [
            'id' => '934',
            'name' => "Вам разрешается прямо или направо, пешеходам - запрещается.",
            'num' => '4',
            'question_id' => '270',
        ]);
        $this->insert('option', [
            'id' => '935',
            'name' => "Разрешается Вам во всех направленнях, водителю трамвая — запрещается.",
            'num' => '1',
            'question_id' => '271',
        ]);
        $this->insert('option', [
            'id' => '936',
            'name' => "Разрешается Вам и водителю трамвая во всех направленнях.",
            'num' => '2',
            'question_id' => '271',
        ]);
        $this->insert('option', [
            'id' => '937',
            'name' => "Разрешается Вам и водителю трамвая только прямо",
            'num' => '3',
            'question_id' => '271',
        ]);
        $this->insert('option', [
            'id' => '938',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '271',
        ]);
        $this->insert('option', [
            'id' => '939',
            'name' => "Поворот направо разрешен при любом сигнале светофора.",
            'num' => '1',
            'question_id' => '272',
        ]);
        $this->insert('option', [
            'id' => '940',
            'name' => "Необходимо уступить дорогу пешеходам при повороте направо.",
            'num' => '2',
            'question_id' => '272',
        ]);
        $this->insert('option', [
            'id' => '941',
            'name' => "Поворот направо разрешается при зеленом сигнале светофора.",
            'num' => '3',
            'question_id' => '272',
        ]);
        $this->insert('option', [
            'id' => '942',
            'name' => "Перед пешеходньїм переходом.",
            'num' => '1',
            'question_id' => '273',
        ]);
        $this->insert('option', [
            'id' => '943',
            'name' => "Перед пересекаемой проезжей частью.",
            'num' => '2',
            'question_id' => '273',
        ]);
        $this->insert('option', [
            'id' => '944',
            'name' => "Не ближе 10м до пешеходного перехода.",
            'num' => '3',
            'question_id' => '273',
        ]);
        $this->insert('option', [
            'id' => '945',
            'name' => "Вам, уступив дорогу микроавтобусу.",
            'num' => '1',
            'question_id' => '274',
        ]);
        $this->insert('option', [
            'id' => '946',
            'name' => "Только Вам.",
            'num' => '2',
            'question_id' => '274',
        ]);
        $this->insert('option', [
            'id' => '947',
            'name' => "Только водителю микроавтобуса.",
            'num' => '3',
            'question_id' => '274',
        ]);
        $this->insert('option', [
            'id' => '948',
            'name' => "Только первьім и третьим.",
            'num' => '1',
            'question_id' => '275',
        ]);
        $this->insert('option', [
            'id' => '949',
            'name' => "Только первьім.",
            'num' => '2',
            'question_id' => '275',
        ]);
        $this->insert('option', [
            'id' => '950',
            'name' => "Первьім. третьим и четвертьм.",
            'num' => '3',
            'question_id' => '275',
        ]);
        $this->insert('option', [
            'id' => '951',
            'name' => "Всеми изображенньїми.",
            'num' => '4',
            'question_id' => '275',
        ]);
        $this->insert('option', [
            'id' => '952',
            'name' => "Вам и водителю трамвая только прямо или направо.",
            'num' => '1',
            'question_id' => '276',
        ]);
        $this->insert('option', [
            'id' => '953',
            'name' => "Вам и водителю трамвая только прямо или налево.",
            'num' => '2',
            'question_id' => '276',
        ]);
        $this->insert('option', [
            'id' => '954',
            'name' => "Вам прямо или направо, водителю трамвая — прямо или налево.",
            'num' => '3',
            'question_id' => '276',
        ]);
        $this->insert('option', [
            'id' => '955',
            'name' => "Вам прямо, налево или на разворот. водителю трамвая — прямо или направо.",
            'num' => '4',
            'question_id' => '276',
        ]);
        $this->insert('option', [
            'id' => '956',
            'name' => "Вам разрешается только направо, пешеходам — запрещается.",
            'num' => '1',
            'question_id' => '277',
        ]);
        $this->insert('option', [
            'id' => '957',
            'name' => "Вам запрещается. пешеходам разрешается только в направлений «Б».",
            'num' => '2',
            'question_id' => '277',
        ]);
        $this->insert('option', [
            'id' => '958',
            'name' => "Вам запрещается. пешеходам разрешается только в направленнях «А» и «В».",
            'num' => '3',
            'question_id' => '277',
        ]);
        $this->insert('option', [
            'id' => '959',
            'name' => "Вам запрещается. пешеходам разрешается во всех и зображеннях стрелками направленнях.",
            'num' => '4',
            'question_id' => '277',
        ]);
        $this->insert('option', [
            'id' => '960',
            'name' => "Только мотоцикла.",
            'num' => '1',
            'question_id' => '278',
        ]);
        $this->insert('option', [
            'id' => '961',
            'name' => "Только легкового автомобиля.",
            'num' => '2',
            'question_id' => '278',
        ]);
        $this->insert('option', [
            'id' => '962',
            'name' => "Обоих.",
            'num' => '3',
            'question_id' => '278',
        ]);
        $this->insert('option', [
            'id' => '963',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '279',
        ]);
        $this->insert('option', [
            'id' => '964',
            'name' => "Разрешается только налево.",
            'num' => '2',
            'question_id' => '279',
        ]);
        $this->insert('option', [
            'id' => '965',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '279',
        ]);
        $this->insert('option', [
            'id' => '966',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '279',
        ]);
        $this->insert('option', [
            'id' => '967',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '280',
        ]);
        $this->insert('option', [
            'id' => '968',
            'name' => "Разрешается прямо или направо.",
            'num' => '2',
            'question_id' => '280',
        ]);
        $this->insert('option', [
            'id' => '969',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '280',
        ]);
        $this->insert('option', [
            'id' => '970',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '280',
        ]);
        $this->insert('option', [
            'id' => '971',
            'name' => "Запрещает.",
            'num' => '1',
            'question_id' => '281',
        ]);
        $this->insert('option', [
            'id' => '972',
            'name' => "Разрешает.",
            'num' => '2',
            'question_id' => '281',
        ]);
        $this->insert('option', [
            'id' => '973',
            'name' => "Разрешает, при отсутствии других транспортных средств.",
            'num' => '3',
            'question_id' => '281',
        ]);
        $this->insert('option', [
            'id' => '974',
            'name' => "Снизить скорость и двигаться в правой полосе как можно правее.",
            'num' => '1',
            'question_id' => '282',
        ]);
        $this->insert('option', [
            'id' => '975',
            'name' => "Остановиться с соблюдением правил остановки.",
            'num' => '2',
            'question_id' => '282',
        ]);
        $this->insert('option', [
            'id' => '976',
            'name' => "Только прямо или направо.",
            'num' => '1',
            'question_id' => '283',
        ]);
        $this->insert('option', [
            'id' => '977',
            'name' => "Только налево.",
            'num' => '2',
            'question_id' => '283',
        ]);
        $this->insert('option', [
            'id' => '978',
            'name' => "Только налево и в обратном направлении.",
            'num' => '3',
            'question_id' => '283',
        ]);
        $this->insert('option', [
            'id' => '979',
            'name' => "В любом направлении.",
            'num' => '4',
            'question_id' => '283',
        ]);
        $this->insert('option', [
            'id' => '980',
            'name' => "Разрешается Вам только налево, пешеходу — в направлении «А».",
            'num' => '1',
            'question_id' => '284',
        ]);
        $this->insert('option', [
            'id' => '981',
            'name' => "Разрешается Вам во всех направлениях, пешеходу — только в направлении «Б».",
            'num' => '2',
            'question_id' => '284',
        ]);
        $this->insert('option', [
            'id' => '982',
            'name' => "Разрешается Вам только прямо, пешеходу — запрещается.",
            'num' => '3',
            'question_id' => '284',
        ]);
        $this->insert('option', [
            'id' => '983',
            'name' => "Разрешается Вам во всех направлениях, пешеходу — запрещается.",
            'num' => '4',
            'question_id' => '284',
        ]);
        $this->insert('option', [
            'id' => '984',
            'name' => "Вам запрещается, пешеходу разрешается в обоих показанных стрелками направлениях.",
            'num' => '5',
            'question_id' => '284',
        ]);
        $this->insert('option', [
            'id' => '985',
            'name' => "Разрешается.",
            'num' => '1',
            'question_id' => '285',
        ]);
        $this->insert('option', [
            'id' => '986',
            'name' => "Запрещается.",
            'num' => '2',
            'question_id' => '285',
        ]);
        $this->insert('option', [
            'id' => '987',
            'name' => "Движение транспортных средств запрещается.",
            'num' => '1',
            'question_id' => '286',
        ]);
        $this->insert('option', [
            'id' => '988',
            'name' => "Сигнализация исправна и движение транспортных средств не запрещено.",
            'num' => '2',
            'question_id' => '286',
        ]);
        $this->insert('option', [
            'id' => '989',
            'name' => "Движение через переезд разрешено только по сигналу дежурного.",
            'num' => '3',
            'question_id' => '286',
        ]);
        $this->insert('option', [
            'id' => '990',
            'name' => "Только водителю автомобиля с включенным проблесковым маячком.",
            'num' => '1',
            'question_id' => '287',
        ]);
        $this->insert('option', [
            'id' => '991',
            'name' => "Только Вам.",
            'num' => '2',
            'question_id' => '287',
        ]);
        $this->insert('option', [
            'id' => '992',
            'name' => "Вам после проезда автомобиля с включенным проблесковым маячком",
            'num' => '3',
            'question_id' => '287',
        ]);
        $this->insert('option', [
            'id' => '993',
            'name' => "Сигнал красного цвета — слева, зеленого — справа.",
            'num' => '1',
            'question_id' => '288',
        ]);
        $this->insert('option', [
            'id' => '994',
            'name' => "Сигнал красного цвета — справа, зеленого — слева.",
            'num' => '2',
            'question_id' => '288',
        ]);
        $this->insert('option', [
            'id' => '995',
            'name' => "Пешеходу разрешается только в направлении «А», Вам — только направо.",
            'num' => '1',
            'question_id' => '289',
        ]);
        $this->insert('option', [
            'id' => '996',
            'name' => "Пешеходу разрешается только в направлении «Б». Вам — запрещается.",
            'num' => '2',
            'question_id' => '289',
        ]);
        $this->insert('option', [
            'id' => '997',
            'name' => "Пешеходу разрешается в изображенных стрелками направлениях, Вам — запрещается.",
            'num' => '3',
            'question_id' => '289',
        ]);
        $this->insert('option', [
            'id' => '998',
            'name' => "Вам и пешеходу запрещается.",
            'num' => '4',
            'question_id' => '289',
        ]);
        $this->insert('option', [
            'id' => '999',
            'name' => "Разрешается только налево",
            'num' => '1',
            'question_id' => '290',
        ]);
        $this->insert('option', [
            'id' => '1000',
            'name' => "Разрешается налево или на разворот.",
            'num' => '2',
            'question_id' => '290',
        ]);
        $this->insert('option', [
            'id' => '1001',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '290',
        ]);
        $this->insert('option', [
            'id' => '1002',
            'name' => "Запрещается.",
            'num' => '1',
            'question_id' => '291',
        ]);
        $this->insert('option', [
            'id' => '1003',
            'name' => "Разрешается лишь при включении зеленого сигнала в основной секции светофора.",
            'num' => '2',
            'question_id' => '291',
        ]);
        $this->insert('option', [
            'id' => '1004',
            'name' => "Разрешается при условии беспрепятственного пропуска транспортных средств, движущихся с других направлений.",
            'num' => '3',
            'question_id' => '291',
        ]);
        $this->insert('option', [
            'id' => '1005',
            'name' => "Разрешается только налево.",
            'num' => '1',
            'question_id' => '292',
        ]);
        $this->insert('option', [
            'id' => '1006',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '292',
        ]);
        $this->insert('option', [
            'id' => '1007',
            'name' => "Разрешается налево или направо.",
            'num' => '3',
            'question_id' => '292',
        ]);
        $this->insert('option', [
            'id' => '1008',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '292',
        ]);
        $this->insert('option', [
            'id' => '1009',
            'name' => "Подземного пешеходного перехода.",
            'num' => '1',
            'question_id' => '293',
        ]);
        $this->insert('option', [
            'id' => '1010',
            'name' => "Школы.",
            'num' => '2',
            'question_id' => '293',
        ]);
        $this->insert('option', [
            'id' => '1011',
            'name' => "Надземного пешеходного перехода.",
            'num' => '3',
            'question_id' => '293',
        ]);
        $this->insert('option', [
            'id' => '1012',
            'name' => "Опасного для перехода проезжей части места.",
            'num' => '4',
            'question_id' => '293',
        ]);
        $this->insert('option', [
            'id' => '1013',
            'name' => "Указывает, что есть дополнительная полоса для движения в данном направлении.",
            'num' => '1',
            'question_id' => '294',
        ]);
        $this->insert('option', [
            'id' => '1014',
            'name' => "Указывает на полосу, по которой движение запрещено.",
            'num' => '2',
            'question_id' => '294',
        ]);
        $this->insert('option', [
            'id' => '1015',
            'name' => "Запрещает движение, информирует о смене сигнала реверсивного светофора и необходимости перестроения на полосу движения справа.",
            'num' => '3',
            'question_id' => '294',
        ]);
        $this->insert('option', [
            'id' => '1016',
            'name' => "Только положение его корпуса и (или) жесты руками.",
            'num' => '1',
            'question_id' => '295',
        ]);
        $this->insert('option', [
            'id' => '1017',
            'name' => "Положение его корпуса, а также жесты руками, в том числе с жезлом или диском с красным световозвращателем.",
            'num' => '2',
            'question_id' => '295',
        ]);
        $this->insert('option', [
            'id' => '1018',
            'name' => "Только жесты руками с жезлом.",
            'num' => '3',
            'question_id' => '295',
        ]);
        $this->insert('option', [
            'id' => '1019',
            'name' => "Разрешает и предупреждает о предстоящей смене сигналов.",
            'num' => '1',
            'question_id' => '296',
        ]);
        $this->insert('option', [
            'id' => '1020',
            'name' => "Разрешает и информирует о предстоящем включении зеленого сигнала.",
            'num' => '2',
            'question_id' => '296',
        ]);
        $this->insert('option', [
            'id' => '1021',
            'name' => "Запрещает и предупреждает о предстоящей смене сигналов.",
            'num' => '3',
            'question_id' => '296',
        ]);
        $this->insert('option', [
            'id' => '1022',
            'name' => "Только водителю красного автомобиля.",
            'num' => '1',
            'question_id' => '297',
        ]);
        $this->insert('option', [
            'id' => '1023',
            'name' => "Только водителю микроавтобуса.",
            'num' => '2',
            'question_id' => '297',
        ]);
        $this->insert('option', [
            'id' => '1024',
            'name' => "Водителям обоих транспортных средств.",
            'num' => '3',
            'question_id' => '297',
        ]);
        $this->insert('option', [
            'id' => '1025',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '298',
        ]);
        $this->insert('option', [
            'id' => '1026',
            'name' => "Вам разрешается прямо или направо, водителю трамвая — только прямо.",
            'num' => '2',
            'question_id' => '298',
        ]);
        $this->insert('option', [
            'id' => '1027',
            'name' => "Вам и водителю трамвая разрешается прямо или направо.",
            'num' => '3',
            'question_id' => '298',
        ]);
        $this->insert('option', [
            'id' => '1028',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '298',
        ]);
        $this->insert('option', [
            'id' => '1029',
            'name' => "Нерегулируемых перекрестков.",
            'num' => '1',
            'question_id' => '299',
        ]);
        $this->insert('option', [
            'id' => '1030',
            'name' => "Регулируемых перекрестков.",
            'num' => '2',
            'question_id' => '299',
        ]);
        $this->insert('option', [
            'id' => '1031',
            'name' => "Движение транспортных средств через переезд запрещено.",
            'num' => '1',
            'question_id' => '300',
        ]);
        $this->insert('option', [
            'id' => '1032',
            'name' => "Сигнализация исправна и движение транспортных средств не запрещено.",
            'num' => '2',
            'question_id' => '300',
        ]);
        $this->insert('option', [
            'id' => '1033',
            'name' => "Разрешается только налево или направо.",
            'num' => '1',
            'question_id' => '301',
        ]);
        $this->insert('option', [
            'id' => '1034',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '301',
        ]);
        $this->insert('option', [
            'id' => '1035',
            'name' => "Разрешается налево или на разворот.",
            'num' => '3',
            'question_id' => '301',
        ]);
        $this->insert('option', [
            'id' => '1036',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '301',
        ]);
        $this->insert('option', [
            'id' => '1037',
            'name' => "Запрещает и информирует о предстоящем включении красного сигнала.",
            'num' => '1',
            'question_id' => '302',
        ]);
        $this->insert('option', [
            'id' => '1038',
            'name' => "Запрещает и информирует о предстоящем включении зеленого сигнала.",
            'num' => '2',
            'question_id' => '302',
        ]);
        $this->insert('option', [
            'id' => '1039',
            'name' => "Разрешает и информирует о предстоящем включении зеленого сигнала.",
            'num' => '3',
            'question_id' => '302',
        ]);
        $this->insert('option', [
            'id' => '1040',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '303',
        ]);
        $this->insert('option', [
            'id' => '1041',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '303',
        ]);
        $this->insert('option', [
            'id' => '1042',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '303',
        ]);
        $this->insert('option', [
            'id' => '1043',
            'name' => "На перекрестках, где проезжая часть имеет не более двух полос для движения в каждом направлении.",
            'num' => '1',
            'question_id' => '304',
        ]);
        $this->insert('option', [
            'id' => '1044',
            'name' => "На железнодорожных переездах.",
            'num' => '2',
            'question_id' => '304',
        ]);
        $this->insert('option', [
            'id' => '1045',
            'name' => "На дорогах с реверсивной полосой.",
            'num' => '3',
            'question_id' => '304',
        ]);
        $this->insert('option', [
            'id' => '1046',
            'name' => "Разрешается Вам и водителю трамвая во всех направлениях.",
            'num' => '1',
            'question_id' => '305',
        ]);
        $this->insert('option', [
            'id' => '1047',
            'name' => "Разрешается Вам и водителю трамвая только прямо.",
            'num' => '2',
            'question_id' => '305',
        ]);
        $this->insert('option', [
            'id' => '1048',
            'name' => "Разрешается Вам прямо или направо, водителю трамвая — только прямо.",
            'num' => '3',
            'question_id' => '305',
        ]);
        $this->insert('option', [
            'id' => '1049',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '305',
        ]);
        $this->insert('option', [
            'id' => '1050',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '306',
        ]);
        $this->insert('option', [
            'id' => '1051',
            'name' => "Разрешается направо или налево.",
            'num' => '2',
            'question_id' => '306',
        ]);
        $this->insert('option', [
            'id' => '1052',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '306',
        ]);
        $this->insert('option', [
            'id' => '1053',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '306',
        ]);
        $this->insert('option', [
            'id' => '1054',
            'name' => "Трамвая.",
            'num' => '1',
            'question_id' => '307',
        ]);
        $this->insert('option', [
            'id' => '1055',
            'name' => "Зеленого автомобиля.",
            'num' => '2',
            'question_id' => '307',
        ]);
        $this->insert('option', [
            'id' => '1056',
            'name' => "Красного автомобиля.",
            'num' => '3',
            'question_id' => '307',
        ]);
        $this->insert('option', [
            'id' => '1057',
            'name' => "Наличии дополнительной секции и указывает направление, в котором разрешено движение при основном сигнале светофора.",
            'num' => '1',
            'question_id' => '308',
        ]);
        $this->insert('option', [
            'id' => '1058',
            'name' => "Разрешенном направлении движения при включении сигнала дополнительной секции.",
            'num' => '2',
            'question_id' => '308',
        ]);
        $this->insert('option', [
            'id' => '1059',
            'name' => "Светофорами или дорожными знаками.",
            'num' => '1',
            'question_id' => '309',
        ]);
        $this->insert('option', [
            'id' => '1060',
            'name' => "Разметкой или дорожным оборудованием.",
            'num' => '2',
            'question_id' => '309',
        ]);
        $this->insert('option', [
            'id' => '1061',
            'name' => "Перечисленными выше средствами или регулировщиком.",
            'num' => '3',
            'question_id' => '309',
        ]);
        $this->insert('option', [
            'id' => '1062',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '310',
        ]);
        $this->insert('option', [
            'id' => '1063',
            'name' => "Вам разрешается прямо или направо, водителю трамвая — только направо.",
            'num' => '2',
            'question_id' => '310',
        ]);
        $this->insert('option', [
            'id' => '1064',
            'name' => "Разрешается Вам направо или налево, водителю трамвая — прямо или направо.",
            'num' => '3',
            'question_id' => '310',
        ]);
        $this->insert('option', [
            'id' => '1065',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '310',
        ]);
        $this->insert('option', [
            'id' => '1066',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '311',
        ]);
        $this->insert('option', [
            'id' => '1067',
            'name' => "Разрешается Вам и водителю трамвая только налево.",
            'num' => '2',
            'question_id' => '311',
        ]);
        $this->insert('option', [
            'id' => '1068',
            'name' => "Разрешается Вам только направо, водителю трамвая — только налево.",
            'num' => '3',
            'question_id' => '311',
        ]);
        $this->insert('option', [
            'id' => '1069',
            'name' => "Запрещается Вам и водителю трамвая.",
            'num' => '4',
            'question_id' => '311',
        ]);
        $this->insert('option', [
            'id' => '1070',
            'name' => "Только первого.",
            'num' => '1',
            'question_id' => '312',
        ]);
        $this->insert('option', [
            'id' => '1071',
            'name' => "Только второго.",
            'num' => '2',
            'question_id' => '312',
        ]);
        $this->insert('option', [
            'id' => '1072',
            'name' => "Только первого, второго и третьего.",
            'num' => '3',
            'question_id' => '312',
        ]);
        $this->insert('option', [
            'id' => '1073',
            'name' => "Только первого, второго и четвертого.",
            'num' => '4',
            'question_id' => '312',
        ]);
        $this->insert('option', [
            'id' => '1074',
            'name' => "Всех изображенных.",
            'num' => '5',
            'question_id' => '312',
        ]);
        $this->insert('option', [
            'id' => '1075',
            'name' => "Разрешает и информирует о наличии опасного нерегулируемого перекрестка.",
            'num' => '1',
            'question_id' => '313',
        ]);
        $this->insert('option', [
            'id' => '1076',
            'name' => "Запрещает и информирует о предстоящем включении зеленого сигнала.",
            'num' => '2',
            'question_id' => '313',
        ]);
        $this->insert('option', [
            'id' => '1077',
            'name' => "Запрещает и информирует о предстоящем включении красного сигнала.",
            'num' => '3',
            'question_id' => '313',
        ]);
        $this->insert('option', [
            'id' => '1078',
            'name' => "Остановиться, перестроившись на правую полосу.",
            'num' => '1',
            'question_id' => '314',
        ]);
        $this->insert('option', [
            'id' => '1079',
            'name' => "Остановить автомобиль перед дорожной разметкой «Стоп-линия».",
            'num' => '2',
            'question_id' => '314',
        ]);
        $this->insert('option', [
            'id' => '1080',
            'name' => "Остановить автомобиль перед светофором.",
            'num' => '3',
            'question_id' => '314',
        ]);
        $this->insert('option', [
            'id' => '1081',
            'name' => "Включенном зеленом сигнале светофора.",
            'num' => '1',
            'question_id' => '315',
        ]);
        $this->insert('option', [
            'id' => '1082',
            'name' => "Желтом и красном сигналах светофора и обязывают уступить дорогу транспортным средствам, движущимся с других направлений.",
            'num' => '2',
            'question_id' => '315',
        ]);
        $this->insert('option', [
            'id' => '1083',
            'name' => "Запрещается.",
            'num' => '1',
            'question_id' => '316',
        ]);
        $this->insert('option', [
            'id' => '1084',
            'name' => "Разрешается.",
            'num' => '2',
            'question_id' => '316',
        ]);
        $this->insert('option', [
            'id' => '1085',
            'name' => "Разрешается только для выполнения опережения, если нет движущихся во встречном направлении транспортных средств.",
            'num' => '3',
            'question_id' => '316',
        ]);
        $this->insert('option', [
            'id' => '1086',
            'name' => "Разрешается только налево или на разворот.",
            'num' => '1',
            'question_id' => '317',
        ]);
        $this->insert('option', [
            'id' => '1087',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '317',
        ]);
        $this->insert('option', [
            'id' => '1088',
            'name' => "Разрешается только прямо, налево или на разворот.",
            'num' => '3',
            'question_id' => '317',
        ]);
        $this->insert('option', [
            'id' => '1089',
            'name' => "Разрешается во всех направлениях.",
            'num' => '4',
            'question_id' => '317',
        ]);
        $this->insert('option', [
            'id' => '1090',
            'name' => "Запрещается.",
            'num' => '5',
            'question_id' => '317',
        ]);
        $this->insert('option', [
            'id' => '1091',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '318',
        ]);
        $this->insert('option', [
            'id' => '1092',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '318',
        ]);
        $this->insert('option', [
            'id' => '1093',
            'name' => "Разрешается только налево.",
            'num' => '3',
            'question_id' => '318',
        ]);
        $this->insert('option', [
            'id' => '1094',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '318',
        ]);
        $this->insert('option', [
            'id' => '1095',
            'name' => "Разрешается.",
            'num' => '1',
            'question_id' => '319',
        ]);
        $this->insert('option', [
            'id' => '1096',
            'name' => "Запрещается.",
            'num' => '2',
            'question_id' => '319',
        ]);
        $this->insert('option', [
            'id' => '1097',
            'name' => "Вам разрешается только направо, пешеходу — только в направлении “А\".",
            'num' => '1',
            'question_id' => '320',
        ]);
        $this->insert('option', [
            'id' => '1098',
            'name' => "Вам разрешается только направо, пешеходу — только в направлении “Б\".",
            'num' => '2',
            'question_id' => '320',
        ]);
        $this->insert('option', [
            'id' => '1099',
            'name' => "Вам разрешается только направо, пешеходу — запрещается в обоих направлениях.",
            'num' => '3',
            'question_id' => '320',
        ]);
        $this->insert('option', [
            'id' => '1100',
            'name' => "Вам запрещается, пешеходу разрешается в изображенных стрелками направлениях.",
            'num' => '4',
            'question_id' => '320',
        ]);
        $this->insert('option', [
            'id' => '1101',
            'name' => "Только Вам.",
            'num' => '1',
            'question_id' => '321',
        ]);
        $this->insert('option', [
            'id' => '1102',
            'name' => "Вам и водителю трамвая.",
            'num' => '2',
            'question_id' => '321',
        ]);
        $this->insert('option', [
            'id' => '1103',
            'name' => "Только водителю трамвая.",
            'num' => '3',
            'question_id' => '321',
        ]);
        $this->insert('option', [
            'id' => '1104',
            'name' => "Водителям всех транспортных средств, уступая дорогу находящимся справа.",
            'num' => '4',
            'question_id' => '321',
        ]);
        $this->insert('option', [
            'id' => '1105',
            'name' => "Первым.",
            'num' => '1',
            'question_id' => '322',
        ]);
        $this->insert('option', [
            'id' => '1106',
            'name' => "Вторым.",
            'num' => '2',
            'question_id' => '322',
        ]);
        $this->insert('option', [
            'id' => '1107',
            'name' => "Третьим.",
            'num' => '3',
            'question_id' => '322',
        ]);
        $this->insert('option', [
            'id' => '1108',
            'name' => "Четвертым.",
            'num' => '4',
            'question_id' => '322',
        ]);
        $this->insert('option', [
            'id' => '1109',
            'name' => "Первым или четвертым.",
            'num' => '5',
            'question_id' => '322',
        ]);
        $this->insert('option', [
            'id' => '1110',
            'name' => "Разрешается только водителю трамвая налево.",
            'num' => '1',
            'question_id' => '323',
        ]);
        $this->insert('option', [
            'id' => '1111',
            'name' => "Разрешается водителю трамвая и вам направо.",
            'num' => '2',
            'question_id' => '323',
        ]);
        $this->insert('option', [
            'id' => '1112',
            'name' => "Разрешается только водителю трамвая направо.",
            'num' => '3',
            'question_id' => '323',
        ]);
        $this->insert('option', [
            'id' => '1113',
            'name' => "Запрещается Вам и водителю трамвая.",
            'num' => '4',
            'question_id' => '323',
        ]);
        $this->insert('option', [
            'id' => '1114',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '324',
        ]);
        $this->insert('option', [
            'id' => '1115',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '324',
        ]);
        $this->insert('option', [
            'id' => '1116',
            'name' => "Разрешается направо и в обратном направлении.",
            'num' => '3',
            'question_id' => '324',
        ]);
        $this->insert('option', [
            'id' => '1117',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '324',
        ]);
        $this->insert('option', [
            'id' => '1118',
            'name' => "Необходимо обязательно остановить его перед пересекаемой проезжей частью.",
            'num' => '1',
            'question_id' => '325',
        ]);
        $this->insert('option', [
            'id' => '1119',
            'name' => "Разрешается двигаться дальше при условии обеспечения безопасности движения.",
            'num' => '2',
            'question_id' => '325',
        ]);
        $this->insert('option', [
            'id' => '1120',
            'name' => "Разрешается двигаться дальше, включив аварийную сигнализацию.",
            'num' => '3',
            'question_id' => '325',
        ]);
        $this->insert('option', [
            'id' => '1121',
            'name' => "Вам и водителю трамвая только прямо.",
            'num' => '1',
            'question_id' => '326',
        ]);
        $this->insert('option', [
            'id' => '1122',
            'name' => "Вам и водителю трамвая прямо или направо.",
            'num' => '2',
            'question_id' => '326',
        ]);
        $this->insert('option', [
            'id' => '1123',
            'name' => "Вам прямо или направо, водителю трамвая — только прямо.",
            'num' => '3',
            'question_id' => '326',
        ]);
        $this->insert('option', [
            'id' => '1124',
            'name' => "Вам во всех направлениях, водителю трамвая — прямо или направо.",
            'num' => '4',
            'question_id' => '326',
        ]);
        $this->insert('option', [
            'id' => '1125',
            'name' => "Только установленного на въезде на перекресток.",
            'num' => '1',
            'question_id' => '327',
        ]);
        $this->insert('option', [
            'id' => '1126',
            'name' => "Только установленного на выезде с перекрестка.",
            'num' => '2',
            'question_id' => '327',
        ]);
        $this->insert('option', [
            'id' => '1127',
            'name' => "Каждого светофора.",
            'num' => '3',
            'question_id' => '327',
        ]);
        $this->insert('option', [
            'id' => '1128',
            'name' => "Только приоритета.",
            'num' => '1',
            'question_id' => '328',
        ]);
        $this->insert('option', [
            'id' => '1129',
            'name' => "Только информационно-указательных.",
            'num' => '2',
            'question_id' => '328',
        ]);
        $this->insert('option', [
            'id' => '1130',
            'name' => "Только предупреждающих и предписывающих.",
            'num' => '3',
            'question_id' => '328',
        ]);
        $this->insert('option', [
            'id' => '1131',
            'name' => "Всех перечисленных выше дорожных знаков.",
            'num' => '4',
            'question_id' => '328',
        ]);
        $this->insert('option', [
            'id' => '1132',
            'name' => "Водителю легкового автомобиля.",
            'num' => '1',
            'question_id' => '329',
        ]);
        $this->insert('option', [
            'id' => '1133',
            'name' => "Водителю микроавтобуса.",
            'num' => '2',
            'question_id' => '329',
        ]);
        $this->insert('option', [
            'id' => '1134',
            'name' => "Водителю грузового автомобиля.",
            'num' => '3',
            'question_id' => '329',
        ]);
        $this->insert('option', [
            'id' => '1135',
            'name' => "Грузового автомобиля.",
            'num' => '1',
            'question_id' => '330',
        ]);
        $this->insert('option', [
            'id' => '1136',
            'name' => "Микроавтобуса.",
            'num' => '2',
            'question_id' => '330',
        ]);
        $this->insert('option', [
            'id' => '1137',
            'name' => "Мотоцикла.",
            'num' => '3',
            'question_id' => '330',
        ]);
        $this->insert('option', [
            'id' => '1138',
            'name' => "Легкового автомобиля.",
            'num' => '4',
            'question_id' => '330',
        ]);
        $this->insert('option', [
            'id' => '1139',
            'name' => "Разрешается только в ситуации, изображенной на левом рисунке.",
            'num' => '1',
            'question_id' => '331',
        ]);
        $this->insert('option', [
            'id' => '1140',
            'name' => "Разрешается только в ситуации, изображенной на правом рисунке.",
            'num' => '2',
            'question_id' => '331',
        ]);
        $this->insert('option', [
            'id' => '1141',
            'name' => "Запрещается в обоих ситуациях.",
            'num' => '3',
            'question_id' => '331',
        ]);
        $this->insert('option', [
            'id' => '1142',
            'name' => "Перед пересекаемой проезжей частью.",
            'num' => '1',
            'question_id' => '332',
        ]);
        $this->insert('option', [
            'id' => '1143',
            'name' => "Перед светофором.",
            'num' => '2',
            'question_id' => '332',
        ]);
        $this->insert('option', [
            'id' => '1144',
            'name' => "Не ближе 10 м до светофора.",
            'num' => '3',
            'question_id' => '332',
        ]);
        $this->insert('option', [
            'id' => '1145',
            'name' => "Вам и водителю трамвая во всех направлениях.",
            'num' => '1',
            'question_id' => '333',
        ]);
        $this->insert('option', [
            'id' => '1146',
            'name' => "Вам и водителю трамвая только прямо или направо.",
            'num' => '2',
            'question_id' => '333',
        ]);
        $this->insert('option', [
            'id' => '1147',
            'name' => "Вам во всех направлениях, водителю трамвая — только направо.",
            'num' => '3',
            'question_id' => '333',
        ]);
        $this->insert('option', [
            'id' => '1148',
            'name' => "Вам и водителю трамвая только направо.",
            'num' => '4',
            'question_id' => '333',
        ]);
        $this->insert('option', [
            'id' => '1149',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '334',
        ]);
        $this->insert('option', [
            'id' => '1150',
            'name' => "Разрешается налево или на разворот.",
            'num' => '2',
            'question_id' => '334',
        ]);
        $this->insert('option', [
            'id' => '1151',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '334',
        ]);
        $this->insert('option', [
            'id' => '1152',
            'name' => "Синего автомобиля.",
            'num' => '1',
            'question_id' => '335',
        ]);
        $this->insert('option', [
            'id' => '1153',
            'name' => "Красного автомобиля.",
            'num' => '2',
            'question_id' => '335',
        ]);
        $this->insert('option', [
            'id' => '1154',
            'name' => "Приближении к опасному участку дороги и характере опасности.",
            'num' => '1',
            'question_id' => '336',
        ]);
        $this->insert('option', [
            'id' => '1155',
            'name' => "Расположении участков дороги, где действуют специальные правила.",
            'num' => '2',
            'question_id' => '336',
        ]);
        $this->insert('option', [
            'id' => '1156',
            'name' => "Приближении к участкам дороги, где вводятся определенные ограничения в движении.",
            'num' => '3',
            'question_id' => '336',
        ]);
        $this->insert('option', [
            'id' => '1157',
            'name' => "Всех перечисленных выше факторах.",
            'num' => '4',
            'question_id' => '336',
        ]);
        $this->insert('option', [
            'id' => '1158',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '337',
        ]);
        $this->insert('option', [
            'id' => '1159',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '337',
        ]);
        $this->insert('option', [
            'id' => '1160',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '337',
        ]);
        $this->insert('option', [
            'id' => '1161',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '337',
        ]);
        $this->insert('option', [
            'id' => '1162',
            'name' => "Имеют.",
            'num' => '1',
            'question_id' => '338',
        ]);
        $this->insert('option', [
            'id' => '1163',
            'name' => "Не имеют.",
            'num' => '2',
            'question_id' => '338',
        ]);
        $this->insert('option', [
            'id' => '1164',
            'name' => "Имеют только перед дорожными знаками.",
            'num' => '3',
            'question_id' => '338',
        ]);
        $this->insert('option', [
            'id' => '1165',
            'name' => "Имеют только перед дорожной разметкой.",
            'num' => '4',
            'question_id' => '338',
        ]);
        $this->insert('option', [
            'id' => '1166',
            'name' => "Только зеленого автомобиля.",
            'num' => '1',
            'question_id' => '339',
        ]);
        $this->insert('option', [
            'id' => '1167',
            'name' => "Только синего автомобиля.",
            'num' => '2',
            'question_id' => '339',
        ]);
        $this->insert('option', [
            'id' => '1168',
            'name' => "Только мотоцикла.",
            'num' => '3',
            'question_id' => '339',
        ]);
        $this->insert('option', [
            'id' => '1169',
            'name' => "Обоих автомобилей.",
            'num' => '4',
            'question_id' => '339',
        ]);
        $this->insert('option', [
            'id' => '1170',
            'name' => "Можете проехать перекресток во всех направлениях.",
            'num' => '1',
            'question_id' => '340',
        ]);
        $this->insert('option', [
            'id' => '1171',
            'name' => "Обязаны остановить автомобиль перед светофором.",
            'num' => '2',
            'question_id' => '340',
        ]);
        $this->insert('option', [
            'id' => '1172',
            'name' => "Можете повернуть направо, пропустив пешеходов.",
            'num' => '3',
            'question_id' => '340',
        ]);
        $this->insert('option', [
            'id' => '1173',
            'name' => "Первым.",
            'num' => '1',
            'question_id' => '341',
        ]);
        $this->insert('option', [
            'id' => '1174',
            'name' => "Вторым.",
            'num' => '2',
            'question_id' => '341',
        ]);
        $this->insert('option', [
            'id' => '1175',
            'name' => "Третьим.",
            'num' => '3',
            'question_id' => '341',
        ]);
        $this->insert('option', [
            'id' => '1176',
            'name' => "Разрешается.",
            'num' => '1',
            'question_id' => '342',
        ]);
        $this->insert('option', [
            'id' => '1177',
            'name' => "Запрещается.",
            'num' => '2',
            'question_id' => '342',
        ]);
        $this->insert('option', [
            'id' => '1178',
            'name' => "Разрешается при отсутствии пешеходов на переходе.",
            'num' => '3',
            'question_id' => '342',
        ]);
        $this->insert('option', [
            'id' => '1179',
            'name' => "Разрешается Вам и водителю трамвая.",
            'num' => '1',
            'question_id' => '343',
        ]);
        $this->insert('option', [
            'id' => '1180',
            'name' => "Разрешается Вам, водителю трамвая — запрещается.",
            'num' => '2',
            'question_id' => '343',
        ]);
        $this->insert('option', [
            'id' => '1181',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '3',
            'question_id' => '343',
        ]);
        $this->insert('option', [
            'id' => '1182',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '344',
        ]);
        $this->insert('option', [
            'id' => '1183',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '344',
        ]);
        $this->insert('option', [
            'id' => '1184',
            'name' => "Разрешается только налево или на разворот.",
            'num' => '3',
            'question_id' => '344',
        ]);
        $this->insert('option', [
            'id' => '1185',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '344',
        ]);
        $this->insert('option', [
            'id' => '1186',
            'name' => "Мотоцикла.",
            'num' => '1',
            'question_id' => '345',
        ]);
        $this->insert('option', [
            'id' => '1187',
            'name' => "Автомобиля.",
            'num' => '2',
            'question_id' => '345',
        ]);
        $this->insert('option', [
            'id' => '1188',
            'name' => "Должны ожидать разрешающего сигнала светофора.",
            'num' => '1',
            'question_id' => '346',
        ]);
        $this->insert('option', [
            'id' => '1189',
            'name' => "Должны уступить дорогу только мотоциклисту.",
            'num' => '2',
            'question_id' => '346',
        ]);
        $this->insert('option', [
            'id' => '1190',
            'name' => "Должны уступить дорогу мотоциклисту и пешеходу.",
            'num' => '3',
            'question_id' => '346',
        ]);
        $this->insert('option', [
            'id' => '1191',
            'name' => "Можете поворачивать имея преимущество.",
            'num' => '4',
            'question_id' => '346',
        ]);
        $this->insert('option', [
            'id' => '1192',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '347',
        ]);
        $this->insert('option', [
            'id' => '1193',
            'name' => "Вам запрещается, водителю трамвая — разрешается только направо.",
            'num' => '2',
            'question_id' => '347',
        ]);
        $this->insert('option', [
            'id' => '1194',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '3',
            'question_id' => '347',
        ]);
        $this->insert('option', [
            'id' => '1195',
            'name' => "Водителю встречного легкового автомобиля.",
            'num' => '1',
            'question_id' => '348',
        ]);
        $this->insert('option', [
            'id' => '1196',
            'name' => "Вам.",
            'num' => '2',
            'question_id' => '348',
        ]);
        $this->insert('option', [
            'id' => '1197',
            'name' => "Водителю грузового автомобиля.",
            'num' => '3',
            'question_id' => '348',
        ]);
        $this->insert('option', [
            'id' => '1198',
            'name' => "Водителям встречного легкового автомобиля и грузового автомобиля.",
            'num' => '4',
            'question_id' => '348',
        ]);
        $this->insert('option', [
            'id' => '1199',
            'name' => "Вам запрещается, пешеходам разрешается только в направлении «А».",
            'num' => '1',
            'question_id' => '349',
        ]);
        $this->insert('option', [
            'id' => '1200',
            'name' => "Вам разрешается направо, пешеходам разрешается только в направлении «Б».",
            'num' => '2',
            'question_id' => '349',
        ]);
        $this->insert('option', [
            'id' => '1201',
            'name' => "Вам запрещается, пешеходам разрешается в изображенных стрелками направлениях.",
            'num' => '3',
            'question_id' => '349',
        ]);
        $this->insert('option', [
            'id' => '1202',
            'name' => "Запрещается Вам и пешеходам.",
            'num' => '4',
            'question_id' => '349',
        ]);
        $this->insert('option', [
            'id' => '1203',
            'name' => "Только в населенном пункте.",
            'num' => '1',
            'question_id' => '350',
        ]);
        $this->insert('option', [
            'id' => '1204',
            'name' => "Только вне населенного пункта.",
            'num' => '2',
            'question_id' => '350',
        ]);
        $this->insert('option', [
            'id' => '1205',
            'name' => "В любом месте.",
            'num' => '3',
            'question_id' => '350',
        ]);
        $this->insert('option', [
            'id' => '1206',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '351',
        ]);
        $this->insert('option', [
            'id' => '1207',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '351',
        ]);
        $this->insert('option', [
            'id' => '1208',
            'name' => "Разрешается налево или на разворот.",
            'num' => '3',
            'question_id' => '351',
        ]);
        $this->insert('option', [
            'id' => '1209',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '351',
        ]);
        $this->insert('option', [
            'id' => '1210',
            'name' => "Вам и водителю трамвая только прямо или направо.",
            'num' => '1',
            'question_id' => '352',
        ]);
        $this->insert('option', [
            'id' => '1211',
            'name' => "Вам и водителю трамвая только прямо или налево.",
            'num' => '2',
            'question_id' => '352',
        ]);
        $this->insert('option', [
            'id' => '1212',
            'name' => "Вам прямо или направо, водителю трамвая — прямо или налево.",
            'num' => '3',
            'question_id' => '352',
        ]);
        $this->insert('option', [
            'id' => '1213',
            'name' => "Вам прямо или налево, водителю трамвая — прямо или направо.",
            'num' => '4',
            'question_id' => '352',
        ]);
        $this->insert('option', [
            'id' => '1214',
            'name' => "Только вводят или отменяют определенный режим движения.",
            'num' => '1',
            'question_id' => '353',
        ]);
        $this->insert('option', [
            'id' => '1215',
            'name' => "Только информируют участников движения о расположении населенных пунктов, различных объектов и территорий, где действуют специальные правила.",
            'num' => '2',
            'question_id' => '353',
        ]);
        $this->insert('option', [
            'id' => '1216',
            'name' => "Применяются во всех перечисленных выше случаях.",
            'num' => '3',
            'question_id' => '353',
        ]);
        $this->insert('option', [
            'id' => '1217',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '354',
        ]);
        $this->insert('option', [
            'id' => '1218',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '354',
        ]);
        $this->insert('option', [
            'id' => '1219',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '354',
        ]);
        $this->insert('option', [
            'id' => '1220',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '354',
        ]);
        $this->insert('option', [
            'id' => '1221',
            'name' => "Разрешают.",
            'num' => '1',
            'question_id' => '355',
        ]);
        $this->insert('option', [
            'id' => '1222',
            'name' => "Разрешают при условии соблюдения безопасности движения.",
            'num' => '2',
            'question_id' => '355',
        ]);
        $this->insert('option', [
            'id' => '1223',
            'name' => "Запрещают.",
            'num' => '3',
            'question_id' => '355',
        ]);
        $this->insert('option', [
            'id' => '1224',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '356',
        ]);
        $this->insert('option', [
            'id' => '1225',
            'name' => "Вам запрещается, водителю трамвая разрешается только направо.",
            'num' => '2',
            'question_id' => '356',
        ]);
        $this->insert('option', [
            'id' => '1226',
            'name' => "Разрешается Вам только направо, водителю трамвая — во всех направлениях.",
            'num' => '3',
            'question_id' => '356',
        ]);
        $this->insert('option', [
            'id' => '1227',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '356',
        ]);
        $this->insert('option', [
            'id' => '1228',
            'name' => "Легкового автомобиля.",
            'num' => '1',
            'question_id' => '357',
        ]);
        $this->insert('option', [
            'id' => '1229',
            'name' => "Автобуса.",
            'num' => '2',
            'question_id' => '357',
        ]);
        $this->insert('option', [
            'id' => '1230',
            'name' => "Разрешается только налево.",
            'num' => '1',
            'question_id' => '358',
        ]);
        $this->insert('option', [
            'id' => '1231',
            'name' => "Разрешается только налево или на разворот.",
            'num' => '2',
            'question_id' => '358',
        ]);
        $this->insert('option', [
            'id' => '1232',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '358',
        ]);
        $this->insert('option', [
            'id' => '1233',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '358',
        ]);
        $this->insert('option', [
            'id' => '1234',
            'name' => "Разрешается Вам и водителю трамвая только направо или налево.",
            'num' => '1',
            'question_id' => '359',
        ]);
        $this->insert('option', [
            'id' => '1235',
            'name' => "Разрешается Вам и водителю трамвая во всех направлениях.",
            'num' => '2',
            'question_id' => '359',
        ]);
        $this->insert('option', [
            'id' => '1236',
            'name' => "Вам разрешается во всех направлениях, водителю трамвая — запрещается.",
            'num' => '3',
            'question_id' => '359',
        ]);
        $this->insert('option', [
            'id' => '1237',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '359',
        ]);
        $this->insert('option', [
            'id' => '1238',
            'name' => "Запрещает.",
            'num' => '1',
            'question_id' => '360',
        ]);
        $this->insert('option', [
            'id' => '1239',
            'name' => "Разрешает.",
            'num' => '2',
            'question_id' => '360',
        ]);
        $this->insert('option', [
            'id' => '1240',
            'name' => "Запрещает только грузовых автомобилей, тракторов, самоходных машин и механизмов.",
            'num' => '3',
            'question_id' => '360',
        ]);
        $this->insert('option', [
            'id' => '1241',
            'name' => "Вам запрещается, пешеходу разрешается только в направлении «А».",
            'num' => '1',
            'question_id' => '361',
        ]);
        $this->insert('option', [
            'id' => '1242',
            'name' => "Вам запрещается, пешеходу разрешается только в направлении «Б».",
            'num' => '2',
            'question_id' => '361',
        ]);
        $this->insert('option', [
            'id' => '1243',
            'name' => "Вам запрещается, пешеходу разрешается в изображенных стрелками направлениях.",
            'num' => '3',
            'question_id' => '361',
        ]);
        $this->insert('option', [
            'id' => '1244',
            'name' => "Вам разрешается прямо или направо, пешеходу — запрещается.",
            'num' => '4',
            'question_id' => '361',
        ]);
        $this->insert('option', [
            'id' => '1245',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '362',
        ]);
        $this->insert('option', [
            'id' => '1246',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '362',
        ]);
        $this->insert('option', [
            'id' => '1247',
            'name' => "Разрешается только налево или на разворот.",
            'num' => '3',
            'question_id' => '362',
        ]);
        $this->insert('option', [
            'id' => '1248',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '362',
        ]);
        $this->insert('option', [
            'id' => '1249',
            'name' => "Во всех направлениях.",
            'num' => '1',
            'question_id' => '363',
        ]);
        $this->insert('option', [
            'id' => '1250',
            'name' => "Только направо.",
            'num' => '2',
            'question_id' => '363',
        ]);
        $this->insert('option', [
            'id' => '1251',
            'name' => "Только прямо или направо.",
            'num' => '3',
            'question_id' => '363',
        ]);
        $this->insert('option', [
            'id' => '1252',
            'name' => "Только прямо.",
            'num' => '4',
            'question_id' => '363',
        ]);
        $this->insert('option', [
            'id' => '1253',
            'name' => "Только налево или на разворот.",
            'num' => '5',
            'question_id' => '363',
        ]);
        $this->insert('option', [
            'id' => '1254',
            'name' => "Запрещается Вам и водителю трамвая.",
            'num' => '1',
            'question_id' => '364',
        ]);
        $this->insert('option', [
            'id' => '1255',
            'name' => "Разрешается Вам и водителю трамвая во всех направлениях.",
            'num' => '2',
            'question_id' => '364',
        ]);
        $this->insert('option', [
            'id' => '1256',
            'name' => "Разрешается водителю трамвая прямо, направо и налево. Вам — запрещается.",
            'num' => '3',
            'question_id' => '364',
        ]);
        $this->insert('option', [
            'id' => '1257',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '365',
        ]);
        $this->insert('option', [
            'id' => '1258',
            'name' => "Разрешается только налево или направо.",
            'num' => '2',
            'question_id' => '365',
        ]);
        $this->insert('option', [
            'id' => '1259',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '365',
        ]);
        $this->insert('option', [
            'id' => '1260',
            'name' => "Разрешается.",
            'num' => '1',
            'question_id' => '366',
        ]);
        $this->insert('option', [
            'id' => '1261',
            'name' => "Запрещается.",
            'num' => '2',
            'question_id' => '366',
        ]);
        $this->insert('option', [
            'id' => '1262',
            'name' => "Только мотоциклу.",
            'num' => '1',
            'question_id' => '367',
        ]);
        $this->insert('option', [
            'id' => '1263',
            'name' => "Только грузовому автомобилю.",
            'num' => '2',
            'question_id' => '367',
        ]);
        $this->insert('option', [
            'id' => '1264',
            'name' => "Только грузовому и легковому автомобилям.",
            'num' => '3',
            'question_id' => '367',
        ]);
        $this->insert('option', [
            'id' => '1265',
            'name' => "Всем транспортным средствам.",
            'num' => '4',
            'question_id' => '367',
        ]);
        $this->insert('option', [
            'id' => '1266',
            'name' => "Перекрестков, пересечений проезжих частей или узких участков дороги.",
            'num' => '1',
            'question_id' => '368',
        ]);
        $this->insert('option', [
            'id' => '1267',
            'name' => "Только перекрестков и пересечений проезжих частей.",
            'num' => '2',
            'question_id' => '368',
        ]);
        $this->insert('option', [
            'id' => '1268',
            'name' => "Только регулируемых перекрестков.",
            'num' => '3',
            'question_id' => '368',
        ]);
        $this->insert('option', [
            'id' => '1269',
            'name' => "Только нерегулируемых перекрестков неравнозначных дорог.",
            'num' => '4',
            'question_id' => '368',
        ]);
        $this->insert('option', [
            'id' => '1270',
            'name' => "Всех перечисленных выше мест.",
            'num' => '5',
            'question_id' => '368',
        ]);
        $this->insert('option', [
            'id' => '1271',
            'name' => "Разрешается Вам только направо, пешеходу — в направлении «А».",
            'num' => '1',
            'question_id' => '369',
        ]);
        $this->insert('option', [
            'id' => '1272',
            'name' => "Разрешается Вам только направо, пешеходу — в направлении «А» или «Б».",
            'num' => '2',
            'question_id' => '369',
        ]);
        $this->insert('option', [
            'id' => '1273',
            'name' => "Вам запрещается, пешеходу — разрешается только в направлении «А».",
            'num' => '3',
            'question_id' => '369',
        ]);
        $this->insert('option', [
            'id' => '1274',
            'name' => "Разрешается Вам только направо, пешеходу — запрещается.",
            'num' => '4',
            'question_id' => '369',
        ]);
        $this->insert('option', [
            'id' => '1275',
            'name' => "Вам и пешеходу запрещается.",
            'num' => '5',
            'question_id' => '369',
        ]);
        $this->insert('option', [
            'id' => '1276',
            'name' => "Во всех направлениях.",
            'num' => '1',
            'question_id' => '370',
        ]);
        $this->insert('option', [
            'id' => '1277',
            'name' => "Только прямо или направо.",
            'num' => '2',
            'question_id' => '370',
        ]);
        $this->insert('option', [
            'id' => '1278',
            'name' => "Только направо.",
            'num' => '3',
            'question_id' => '370',
        ]);
        $this->insert('option', [
            'id' => '1279',
            'name' => "Только прямо.",
            'num' => '4',
            'question_id' => '370',
        ]);
        $this->insert('option', [
            'id' => '1280',
            'name' => "Запрещает движение в указанном направлении.",
            'num' => '1',
            'question_id' => '371',
        ]);
        $this->insert('option', [
            'id' => '1281',
            'name' => "Разрешает движение в указанном направлении.",
            'num' => '2',
            'question_id' => '371',
        ]);
        $this->insert('option', [
            'id' => '1282',
            'name' => "Информирует о разрешенном переходе проезжей части, на которую водитель осуществляет поворот, пешеходами.",
            'num' => '3',
            'question_id' => '371',
        ]);
        $this->insert('option', [
            'id' => '1283',
            'name' => "Разрешается Вами водителю трамвая только прямо.",
            'num' => '1',
            'question_id' => '372',
        ]);
        $this->insert('option', [
            'id' => '1284',
            'name' => "Разрешается Вам во всех направлениях, водителю трамвая — только прямо.",
            'num' => '2',
            'question_id' => '372',
        ]);
        $this->insert('option', [
            'id' => '1285',
            'name' => "Разрешается Вам и водителю трамвая только налево.",
            'num' => '3',
            'question_id' => '372',
        ]);
        $this->insert('option', [
            'id' => '1286',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '372',
        ]);
        $this->insert('option', [
            'id' => '1287',
            'name' => "Только мотоциклу.",
            'num' => '1',
            'question_id' => '373',
        ]);
        $this->insert('option', [
            'id' => '1288',
            'name' => "Только легковому автомобилю.",
            'num' => '2',
            'question_id' => '373',
        ]);
        $this->insert('option', [
            'id' => '1289',
            'name' => "Только легковому автомобилю и мотоциклу.",
            'num' => '3',
            'question_id' => '373',
        ]);
        $this->insert('option', [
            'id' => '1290',
            'name' => "Только мотоциклу и трамваю.",
            'num' => '4',
            'question_id' => '373',
        ]);
        $this->insert('option', [
            'id' => '1291',
            'name' => "Всем транспортным средствам.",
            'num' => '5',
            'question_id' => '373',
        ]);
        $this->insert('option', [
            'id' => '1292',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '374',
        ]);
        $this->insert('option', [
            'id' => '1293',
            'name' => "Вам запрещается, водителю трамвая разрешается только направо.",
            'num' => '2',
            'question_id' => '374',
        ]);
        $this->insert('option', [
            'id' => '1294',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '3',
            'question_id' => '374',
        ]);
        $this->insert('option', [
            'id' => '1295',
            'name' => "Разрешает.",
            'num' => '1',
            'question_id' => '375',
        ]);
        $this->insert('option', [
            'id' => '1296',
            'name' => "Запрещает.",
            'num' => '2',
            'question_id' => '375',
        ]);
        $this->insert('option', [
            'id' => '1297',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '376',
        ]);
        $this->insert('option', [
            'id' => '1298',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '376',
        ]);
        $this->insert('option', [
            'id' => '1299',
            'name' => "Разрешается только прямо или направо.",
            'num' => '3',
            'question_id' => '376',
        ]);
        $this->insert('option', [
            'id' => '1300',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '376',
        ]);
        $this->insert('option', [
            'id' => '1301',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '377',
        ]);
        $this->insert('option', [
            'id' => '1302',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '377',
        ]);
        $this->insert('option', [
            'id' => '1303',
            'name' => "Разрешается налево или на разворот.",
            'num' => '3',
            'question_id' => '377',
        ]);
        $this->insert('option', [
            'id' => '1304',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '377',
        ]);
        $this->insert('option', [
            'id' => '1305',
            'name' => "Разрешается Вам и водителю трамвая только прямо или направо.",
            'num' => '1',
            'question_id' => '378',
        ]);
        $this->insert('option', [
            'id' => '1306',
            'name' => "Разрешается Вам прямо или направо, водителю трамвая — только прямо.",
            'num' => '2',
            'question_id' => '378',
        ]);
        $this->insert('option', [
            'id' => '1307',
            'name' => "Разрешается Вам и водителю трамвая во всех направлениях.",
            'num' => '3',
            'question_id' => '378',
        ]);
        $this->insert('option', [
            'id' => '1308',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '378',
        ]);
        $this->insert('option', [
            'id' => '1309',
            'name' => "Наличии дополнительной полосы для движения в данном направлении.",
            'num' => '1',
            'question_id' => '379',
        ]);
        $this->insert('option', [
            'id' => '1310',
            'name' => "Преимуществе при движении по указанной стрелкой полосе.",
            'num' => '2',
            'question_id' => '379',
        ]);
        $this->insert('option', [
            'id' => '1311',
            'name' => "Смене сигнала реверсивного светофора и необходимости перестроения на полосу движения справа.",
            'num' => '3',
            'question_id' => '379',
        ]);
        $this->insert('option', [
            'id' => '1312',
            'name' => "Всем вышеперечисленном.",
            'num' => '4',
            'question_id' => '379',
        ]);
        $this->insert('option', [
            'id' => '1313',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '380',
        ]);
        $this->insert('option', [
            'id' => '1314',
            'name' => "Вам разрешается прямо или направо, водителю трамвая — только прямо.",
            'num' => '2',
            'question_id' => '380',
        ]);
        $this->insert('option', [
            'id' => '1315',
            'name' => "Вам и водителю трамвая разрешается прямо или направо.",
            'num' => '3',
            'question_id' => '380',
        ]);
        $this->insert('option', [
            'id' => '1316',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '380',
        ]);
        $this->insert('option', [
            'id' => '1317',
            'name' => "Остановить транспортное средство перед перекрестком и ожидать разрешающего сигнала регулировщика.",
            'num' => '1',
            'question_id' => '381',
        ]);
        $this->insert('option', [
            'id' => '1318',
            'name' => "Занять крайнее правое положение и быть готовым пропустить пешеходов, переходящих проезжую часть за спиной регулировщика.",
            'num' => '2',
            'question_id' => '381',
        ]);
        $this->insert('option', [
            'id' => '1319',
            'name' => "Вам и водителю трамвая разрешено только прямо.",
            'num' => '1',
            'question_id' => '382',
        ]);
        $this->insert('option', [
            'id' => '1320',
            'name' => "Вам и водителю трамвая разрешено во всех направлениях.",
            'num' => '2',
            'question_id' => '382',
        ]);
        $this->insert('option', [
            'id' => '1321',
            'name' => "Вам разрешено во всех направлениях, водителю трамвая — запрещено.",
            'num' => '3',
            'question_id' => '382',
        ]);
        $this->insert('option', [
            'id' => '1322',
            'name' => "Вам разрешено только прямо или направо, водителю трамвая — прямо или налево.",
            'num' => '4',
            'question_id' => '382',
        ]);
        $this->insert('option', [
            'id' => '1323',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '383',
        ]);
        $this->insert('option', [
            'id' => '1324',
            'name' => "Разрешается Вам во всех направлениях, водителю трамвая — прямо или налево.",
            'num' => '2',
            'question_id' => '383',
        ]);
        $this->insert('option', [
            'id' => '1325',
            'name' => "Разрешается водителю трамвая только налево, Вам — запрещается.",
            'num' => '3',
            'question_id' => '383',
        ]);
        $this->insert('option', [
            'id' => '1326',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '383',
        ]);
        $this->insert('option', [
            'id' => '1327',
            'name' => "Запрещается.",
            'num' => '1',
            'question_id' => '384',
        ]);
        $this->insert('option', [
            'id' => '1328',
            'name' => "Разрешается во всех случаях.",
            'num' => '2',
            'question_id' => '384',
        ]);
        $this->insert('option', [
            'id' => '1329',
            'name' => "Разрешается, если он не запрещен дорожными знаками.",
            'num' => '3',
            'question_id' => '384',
        ]);
        $this->insert('option', [
            'id' => '1330',
            'name' => "Только легковому автомобилю.",
            'num' => '1',
            'question_id' => '385',
        ]);
        $this->insert('option', [
            'id' => '1331',
            'name' => "Легковому и грузовому автомобилям.",
            'num' => '2',
            'question_id' => '385',
        ]);
        $this->insert('option', [
            'id' => '1332',
            'name' => "Только грузовому автомобилю.",
            'num' => '3',
            'question_id' => '385',
        ]);
        $this->insert('option', [
            'id' => '1333',
            'name' => "Только автобусу.",
            'num' => '4',
            'question_id' => '385',
        ]);
        $this->insert('option', [
            'id' => '1334',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '386',
        ]);
        $this->insert('option', [
            'id' => '1335',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '386',
        ]);
        $this->insert('option', [
            'id' => '1336',
            'name' => "Разрешается прямо и в обратном направлении.",
            'num' => '3',
            'question_id' => '386',
        ]);
        $this->insert('option', [
            'id' => '1337',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '386',
        ]);
        $this->insert('option', [
            'id' => '1338',
            'name' => "Вводят или отменяют определенные режимы движения.",
            'num' => '1',
            'question_id' => '387',
        ]);
        $this->insert('option', [
            'id' => '1339',
            'name' => "Вводят или отменяют определенные ограничения в движении.",
            'num' => '2',
            'question_id' => '387',
        ]);
        $this->insert('option', [
            'id' => '1340',
            'name' => "Вводят или отменяют определенный порядок проезда участков дорог",
            'num' => '3',
            'question_id' => '387',
        ]);
        $this->insert('option', [
            'id' => '1341',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '388',
        ]);
        $this->insert('option', [
            'id' => '1342',
            'name' => "Разрешается прямо или направо.",
            'num' => '2',
            'question_id' => '388',
        ]);
        $this->insert('option', [
            'id' => '1343',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '388',
        ]);
        $this->insert('option', [
            'id' => '1344',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '388',
        ]);
        $this->insert('option', [
            'id' => '1345',
            'name' => "Всех.",
            'num' => '1',
            'question_id' => '389',
        ]);
        $this->insert('option', [
            'id' => '1346',
            'name' => "Только автобуса.",
            'num' => '2',
            'question_id' => '389',
        ]);
        $this->insert('option', [
            'id' => '1347',
            'name' => "Только грузового автомобиля и велосипеда.",
            'num' => '3',
            'question_id' => '389',
        ]);
        $this->insert('option', [
            'id' => '1348',
            'name' => "Разрешается Вам только направо, пешеходу — в направлении «Б».",
            'num' => '1',
            'question_id' => '390',
        ]);
        $this->insert('option', [
            'id' => '1349',
            'name' => "Разрешается Вам только направо, пешеходу — в направлении «А» или «Б».",
            'num' => '2',
            'question_id' => '390',
        ]);
        $this->insert('option', [
            'id' => '1350',
            'name' => "Вам запрещается, пешеходу разрешается только в направлении «А».",
            'num' => '3',
            'question_id' => '390',
        ]);
        $this->insert('option', [
            'id' => '1351',
            'name' => "Вам и пешеходу запрещается.",
            'num' => '4',
            'question_id' => '390',
        ]);
        $this->insert('option', [
            'id' => '1352',
            'name' => "Только трамваю и грузовому автомобилю.",
            'num' => '1',
            'question_id' => '391',
        ]);
        $this->insert('option', [
            'id' => '1353',
            'name' => "Только грузовому автомобилю.",
            'num' => '2',
            'question_id' => '391',
        ]);
        $this->insert('option', [
            'id' => '1354',
            'name' => "Только грузовому и легковому автомобилям.",
            'num' => '3',
            'question_id' => '391',
        ]);
        $this->insert('option', [
            'id' => '1355',
            'name' => "Трамваю, грузовому и легковому автомобилям.",
            'num' => '4',
            'question_id' => '391',
        ]);
        $this->insert('option', [
            'id' => '1356',
            'name' => "Должен остановить транспортное средство в месте, на которое укажет регулировщик, с соблюдением правил остановки.",
            'num' => '1',
            'question_id' => '392',
        ]);
        $this->insert('option', [
            'id' => '1357',
            'name' => "Обязан немедленно остановить транспортное средство и включить аварийную световую сигнализацию.",
            'num' => '2',
            'question_id' => '392',
        ]);
        $this->insert('option', [
            'id' => '1358',
            'name' => "Снизить скорость и перестроиться для движения как можно ближе к правому краю проезжей части.",
            'num' => '3',
            'question_id' => '392',
        ]);
        $this->insert('option', [
            'id' => '1359',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '393',
        ]);
        $this->insert('option', [
            'id' => '1360',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '393',
        ]);
        $this->insert('option', [
            'id' => '1361',
            'name' => "Разрешается прямо или направо.",
            'num' => '3',
            'question_id' => '393',
        ]);
        $this->insert('option', [
            'id' => '1362',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '393',
        ]);
        $this->insert('option', [
            'id' => '1363',
            'name' => "Вам разрешается во всех направлениях, водителю трамвая — запрещается.",
            'num' => '1',
            'question_id' => '394',
        ]);
        $this->insert('option', [
            'id' => '1364',
            'name' => "Вам разрешается только налево, водителю трамвая - направо или налево.",
            'num' => '2',
            'question_id' => '394',
        ]);
        $this->insert('option', [
            'id' => '1365',
            'name' => "Вам разрешается во всех направлениях, водителю трамвая - только налево.",
            'num' => '3',
            'question_id' => '394',
        ]);
        $this->insert('option', [
            'id' => '1366',
            'name' => "Вам и водителю трамвая разрешается во всех направлениях.",
            'num' => '4',
            'question_id' => '394',
        ]);
        $this->insert('option', [
            'id' => '1367',
            'name' => "Разрешается только налево.",
            'num' => '1',
            'question_id' => '395',
        ]);
        $this->insert('option', [
            'id' => '1368',
            'name' => "Разрешается только прямо или налево.",
            'num' => '2',
            'question_id' => '395',
        ]);
        $this->insert('option', [
            'id' => '1369',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '395',
        ]);
        $this->insert('option', [
            'id' => '1370',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '395',
        ]);
        $this->insert('option', [
            'id' => '1371',
            'name' => "Движение разрешается, но необходимо уступить дорогу другим транспортным средствам.",
            'num' => '1',
            'question_id' => '396',
        ]);
        $this->insert('option', [
            'id' => '1372',
            'name' => "Вы имеете преимущество в указанном стрелкой направлении движения перед водителями транспортных средств, движущихся с других направлений.",
            'num' => '2',
            'question_id' => '396',
        ]);
        $this->insert('option', [
            'id' => '1373',
            'name' => "Движение в направлении стрелки запрещается.",
            'num' => '3',
            'question_id' => '396',
        ]);
        $this->insert('option', [
            'id' => '1374',
            'name' => "Разрешается Вам и водителю трамвая во всех направлениях.",
            'num' => '1',
            'question_id' => '397',
        ]);
        $this->insert('option', [
            'id' => '1375',
            'name' => "Разрешается Вам и водителю трамвая только прямо.",
            'num' => '2',
            'question_id' => '397',
        ]);
        $this->insert('option', [
            'id' => '1376',
            'name' => "Вам и водителю трамвая запрещается во всех направлениях.",
            'num' => '3',
            'question_id' => '397',
        ]);
        $this->insert('option', [
            'id' => '1377',
            'name' => "Разрешается.",
            'num' => '1',
            'question_id' => '398',
        ]);
        $this->insert('option', [
            'id' => '1378',
            'name' => "Запрещается.",
            'num' => '2',
            'question_id' => '398',
        ]);
        $this->insert('option', [
            'id' => '1379',
            'name' => "Разрешается только налево или направо.",
            'num' => '1',
            'question_id' => '399',
        ]);
        $this->insert('option', [
            'id' => '1380',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '399',
        ]);
        $this->insert('option', [
            'id' => '1381',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '399',
        ]);
        $this->insert('option', [
            'id' => '1382',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '399',
        ]);
        $this->insert('option', [
            'id' => '1383',
            'name' => "Разрешается только налево.",
            'num' => '1',
            'question_id' => '400',
        ]);
        $this->insert('option', [
            'id' => '1384',
            'name' => "Разрешается только налево или на разворот.",
            'num' => '2',
            'question_id' => '400',
        ]);
        $this->insert('option', [
            'id' => '1385',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '400',
        ]);
        $this->insert('option', [
            'id' => '1386',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '400',
        ]);
        $this->insert('option', [
            'id' => '1387',
            'name' => "Только Вам.",
            'num' => '1',
            'question_id' => '401',
        ]);
        $this->insert('option', [
            'id' => '1388',
            'name' => "Вам и водителю трамвая.",
            'num' => '2',
            'question_id' => '401',
        ]);
        $this->insert('option', [
            'id' => '1389',
            'name' => "Только водителю трамвая.",
            'num' => '3',
            'question_id' => '401',
        ]);
        $this->insert('option', [
            'id' => '1390',
            'name' => "Разрешается Вам и водителю трамвая только прямо.",
            'num' => '1',
            'question_id' => '402',
        ]);
        $this->insert('option', [
            'id' => '1391',
            'name' => "Разрешается Вам и водителю трамвая прямо или направо.",
            'num' => '2',
            'question_id' => '402',
        ]);
        $this->insert('option', [
            'id' => '1392',
            'name' => "Разрешается Вам прямо или направо, водителю трамвая — только прямо.",
            'num' => '3',
            'question_id' => '402',
        ]);
        $this->insert('option', [
            'id' => '1393',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '402',
        ]);
        $this->insert('option', [
            'id' => '1394',
            'name' => "Разрешается только поворот направо.",
            'num' => '1',
            'question_id' => '403',
        ]);
        $this->insert('option', [
            'id' => '1395',
            'name' => "Разрешается движение прямо или направо.",
            'num' => '2',
            'question_id' => '403',
        ]);
        $this->insert('option', [
            'id' => '1396',
            'name' => "Движение запрещено.",
            'num' => '3',
            'question_id' => '403',
        ]);
        $this->insert('option', [
            'id' => '1397',
            'name' => "Только показывают обязательные направления движения.",
            'num' => '1',
            'question_id' => '404',
        ]);
        $this->insert('option', [
            'id' => '1398',
            'name' => "Только разрешают движение некоторым категориям его участников по отдельным участкам проезжей части.",
            'num' => '2',
            'question_id' => '404',
        ]);
        $this->insert('option', [
            'id' => '1399',
            'name' => "Только вводят или отменяют некоторые ограничения в движении.",
            'num' => '3',
            'question_id' => '404',
        ]);
        $this->insert('option', [
            'id' => '1400',
            'name' => "Обязывают выполнять предписания изложенные во всех перечисленных выше ответах.",
            'num' => '4',
            'question_id' => '404',
        ]);
        $this->insert('option', [
            'id' => '1401',
            'name' => "Обязывают выполнять предписания, изложенные в ответах 1 и 2.",
            'num' => '5',
            'question_id' => '404',
        ]);
        $this->insert('option', [
            'id' => '1402',
            'name' => "Только легкового.",
            'num' => '1',
            'question_id' => '405',
        ]);
        $this->insert('option', [
            'id' => '1403',
            'name' => "Только грузового.",
            'num' => '2',
            'question_id' => '405',
        ]);
        $this->insert('option', [
            'id' => '1404',
            'name' => "Оба нарушают.",
            'num' => '3',
            'question_id' => '405',
        ]);
        $this->insert('option', [
            'id' => '1405',
            'name' => "Разрешается направо или налево.",
            'num' => '1',
            'question_id' => '406',
        ]);
        $this->insert('option', [
            'id' => '1406',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '406',
        ]);
        $this->insert('option', [
            'id' => '1407',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '406',
        ]);
        $this->insert('option', [
            'id' => '1408',
            'name' => "Разрешается Вам и водителю трамвая только прямо.",
            'num' => '1',
            'question_id' => '407',
        ]);
        $this->insert('option', [
            'id' => '1409',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '2',
            'question_id' => '407',
        ]);
        $this->insert('option', [
            'id' => '1410',
            'name' => "Разрешается водителю трамвая только прямо, Вам — запрещается.",
            'num' => '3',
            'question_id' => '407',
        ]);
        $this->insert('option', [
            'id' => '1411',
            'name' => "Разрешается Вам только налево, водителю трамвая — только прямо.",
            'num' => '4',
            'question_id' => '407',
        ]);
        $this->insert('option', [
            'id' => '1412',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '408',
        ]);
        $this->insert('option', [
            'id' => '1413',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '408',
        ]);
        $this->insert('option', [
            'id' => '1414',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '408',
        ]);
        $this->insert('option', [
            'id' => '1415',
            'name' => "Трех верхних сигналов.",
            'num' => '1',
            'question_id' => '409',
        ]);
        $this->insert('option', [
            'id' => '1416',
            'name' => "Нижнего и одного или нескольких верхних сигналов.",
            'num' => '2',
            'question_id' => '409',
        ]);
        $this->insert('option', [
            'id' => '1417',
            'name' => "Любого из верхних сигналов.",
            'num' => '3',
            'question_id' => '409',
        ]);
        $this->insert('option', [
            'id' => '1418',
            'name' => "Только первый светофор.",
            'num' => '1',
            'question_id' => '410',
        ]);
        $this->insert('option', [
            'id' => '1419',
            'name' => "Только второй светофор.",
            'num' => '2',
            'question_id' => '410',
        ]);
        $this->insert('option', [
            'id' => '1420',
            'name' => "Первый и второй светофор.",
            'num' => '3',
            'question_id' => '410',
        ]);
        $this->insert('option', [
            'id' => '1421',
            'name' => "Разрешается Вам во всех направлениях, водителю трамвая только налево.",
            'num' => '1',
            'question_id' => '411',
        ]);
        $this->insert('option', [
            'id' => '1422',
            'name' => "Разрешается Вам во всех направлениях, водителю трамвая — прямо или налево.",
            'num' => '2',
            'question_id' => '411',
        ]);
        $this->insert('option', [
            'id' => '1423',
            'name' => "Разрешается Вам только налево, водителю трамвая —прямо или налево.",
            'num' => '3',
            'question_id' => '411',
        ]);
        $this->insert('option', [
            'id' => '1424',
            'name' => "Вам запрещается, водителю трамвая разрешается прямо или налево.",
            'num' => '4',
            'question_id' => '411',
        ]);
        $this->insert('option', [
            'id' => '1425',
            'name' => "Прямо, налево или на разворот.",
            'num' => '1',
            'question_id' => '412',
        ]);
        $this->insert('option', [
            'id' => '1426',
            'name' => "Во всех направлениях.",
            'num' => '2',
            'question_id' => '412',
        ]);
        $this->insert('option', [
            'id' => '1427',
            'name' => "Только налево или на разворот.",
            'num' => '3',
            'question_id' => '412',
        ]);
        $this->insert('option', [
            'id' => '1428',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '413',
        ]);
        $this->insert('option', [
            'id' => '1429',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '413',
        ]);
        $this->insert('option', [
            'id' => '1430',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '413',
        ]);
        $this->insert('option', [
            'id' => '1431',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '413',
        ]);
        $this->insert('option', [
            'id' => '1432',
            'name' => "Вам разрешается во всех направлениях, водителю трамвая — запрещается.",
            'num' => '1',
            'question_id' => '414',
        ]);
        $this->insert('option', [
            'id' => '1433',
            'name' => "Вам разрешается только направо, водителю трамвая — только налево.",
            'num' => '2',
            'question_id' => '414',
        ]);
        $this->insert('option', [
            'id' => '1434',
            'name' => "Вам разрешается во всех направлениях, водителю трамвая — только налево.",
            'num' => '3',
            'question_id' => '414',
        ]);
        $this->insert('option', [
            'id' => '1435',
            'name' => "Вам и водителю трамвая разрешено только налево",
            'num' => '4',
            'question_id' => '414',
        ]);
        $this->insert('option', [
            'id' => '1436',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '415',
        ]);
        $this->insert('option', [
            'id' => '1437',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '415',
        ]);
        $this->insert('option', [
            'id' => '1438',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '415',
        ]);
        $this->insert('option', [
            'id' => '1439',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '415',
        ]);
        $this->insert('option', [
            'id' => '1440',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '416',
        ]);
        $this->insert('option', [
            'id' => '1441',
            'name' => "Разрешается только направо или налево.",
            'num' => '2',
            'question_id' => '416',
        ]);
        $this->insert('option', [
            'id' => '1442',
            'name' => "Разрешается налево или на разворот.",
            'num' => '3',
            'question_id' => '416',
        ]);
        $this->insert('option', [
            'id' => '1443',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '416',
        ]);
        $this->insert('option', [
            'id' => '1444',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '417',
        ]);
        $this->insert('option', [
            'id' => '1445',
            'name' => "Вам запрещается, водителю трамвая — только налево.",
            'num' => '2',
            'question_id' => '417',
        ]);
        $this->insert('option', [
            'id' => '1446',
            'name' => "Вам разрешается только прямо, водителю трамвая — запрещается.",
            'num' => '3',
            'question_id' => '417',
        ]);
        $this->insert('option', [
            'id' => '1447',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '417',
        ]);
        $this->insert('option', [
            'id' => '1448',
            'name' => "Только транспортным средствам.",
            'num' => '1',
            'question_id' => '418',
        ]);
        $this->insert('option', [
            'id' => '1449',
            'name' => "Транспортным средствам и пешеходам.",
            'num' => '2',
            'question_id' => '418',
        ]);
        $this->insert('option', [
            'id' => '1450',
            'name' => "Только пешеходам.",
            'num' => '3',
            'question_id' => '418',
        ]);
        $this->insert('option', [
            'id' => '1451',
            'name' => "Разрешается только налево.",
            'num' => '1',
            'question_id' => '419',
        ]);
        $this->insert('option', [
            'id' => '1452',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '419',
        ]);
        $this->insert('option', [
            'id' => '1453',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '419',
        ]);
        $this->insert('option', [
            'id' => '1454',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '419',
        ]);
        $this->insert('option', [
            'id' => '1455',
            'name' => "Разрешается только зодителю трамвая.",
            'num' => '1',
            'question_id' => '420',
        ]);
        $this->insert('option', [
            'id' => '1456',
            'name' => "Разрешается Вам и зодителю трамвая.",
            'num' => '2',
            'question_id' => '420',
        ]);
        $this->insert('option', [
            'id' => '1457',
            'name' => "Разрешается только Вам.",
            'num' => '3',
            'question_id' => '420',
        ]);
        $this->insert('option', [
            'id' => '1458',
            'name' => "Запрещается всем.",
            'num' => '4',
            'question_id' => '420',
        ]);
        $this->insert('option', [
            'id' => '1459',
            'name' => "Движение в направлении стрелки разрешается при условии беспрепятственного пропуска транспортных средств, движущихся с других направлений.",
            'num' => '1',
            'question_id' => '421',
        ]);
        $this->insert('option', [
            'id' => '1460',
            'name' => "Они имеют преимущество в движении в направлении стрелки перед водителями транспортных средств, движущихся с других направлений.",
            'num' => '2',
            'question_id' => '421',
        ]);
        $this->insert('option', [
            'id' => '1461',
            'name' => "Движение транспортных средств в направлении стрелки запрещается.",
            'num' => '3',
            'question_id' => '421',
        ]);
        $this->insert('option', [
            'id' => '1462',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '422',
        ]);
        $this->insert('option', [
            'id' => '1463',
            'name' => "Разрешается прямо и направо.",
            'num' => '2',
            'question_id' => '422',
        ]);
        $this->insert('option', [
            'id' => '1464',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '422',
        ]);
        $this->insert('option', [
            'id' => '1465',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '422',
        ]);
        $this->insert('option', [
            'id' => '1466',
            'name' => "Разрешается Вам и водителю трамвая только прямо.",
            'num' => '1',
            'question_id' => '423',
        ]);
        $this->insert('option', [
            'id' => '1467',
            'name' => "Вам запрещается, водителю трамвая — разрешается прямо или налево.",
            'num' => '2',
            'question_id' => '423',
        ]);
        $this->insert('option', [
            'id' => '1468',
            'name' => "Разрешается Вам и водителю трамвая только налево.",
            'num' => '3',
            'question_id' => '423',
        ]);
        $this->insert('option', [
            'id' => '1469',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '424',
        ]);
        $this->insert('option', [
            'id' => '1470',
            'name' => "Разрешается налево или на разворот.",
            'num' => '2',
            'question_id' => '424',
        ]);
        $this->insert('option', [
            'id' => '1471',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '424',
        ]);
        $this->insert('option', [
            'id' => '1472',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '424',
        ]);
        $this->insert('option', [
            'id' => '1473',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '425',
        ]);
        $this->insert('option', [
            'id' => '1474',
            'name' => "Разрешается только направо или налево.",
            'num' => '2',
            'question_id' => '425',
        ]);
        $this->insert('option', [
            'id' => '1475',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '425',
        ]);
        $this->insert('option', [
            'id' => '1476',
            'name' => "Только на пешеходов.",
            'num' => '1',
            'question_id' => '426',
        ]);
        $this->insert('option', [
            'id' => '1477',
            'name' => "На пешеходов и водителей велосипедов.",
            'num' => '2',
            'question_id' => '426',
        ]);
        $this->insert('option', [
            'id' => '1478',
            'name' => "На пешеходов и водителей всех транспортных средств.",
            'num' => '3',
            'question_id' => '426',
        ]);
        $this->insert('option', [
            'id' => '1479',
            'name' => "В один ряд.",
            'num' => '1',
            'question_id' => '427',
        ]);
        $this->insert('option', [
            'id' => '1480',
            'name' => "По всей ширине проезжей части.",
            'num' => '2',
            'question_id' => '427',
        ]);
        $this->insert('option', [
            'id' => '1481',
            'name' => "По полосе, над которой он расположен.",
            'num' => '3',
            'question_id' => '427',
        ]);
        $this->insert('option', [
            'id' => '1482',
            'name' => "Вам и водителю трамвая только налево.",
            'num' => '1',
            'question_id' => '428',
        ]);
        $this->insert('option', [
            'id' => '1483',
            'name' => "Вам и водителю трамвая только прямо.",
            'num' => '2',
            'question_id' => '428',
        ]);
        $this->insert('option', [
            'id' => '1484',
            'name' => "Вам во всех направлениях, водителю трамвая — только налево.",
            'num' => '3',
            'question_id' => '428',
        ]);
        $this->insert('option', [
            'id' => '1485',
            'name' => "Водителю трамвая только прямо, Вам - запрещается.",
            'num' => '4',
            'question_id' => '428',
        ]);
        $this->insert('option', [
            'id' => '1486',
            'name' => "Требованиями правила “помеха справа\".",
            'num' => '1',
            'question_id' => '429',
        ]);
        $this->insert('option', [
            'id' => '1487',
            'name' => "Требованиями светофоров со световыми сигналами красного, желтого и зеленого цветов.",
            'num' => '2',
            'question_id' => '429',
        ]);
        $this->insert('option', [
            'id' => '1488',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '430',
        ]);
        $this->insert('option', [
            'id' => '1489',
            'name' => "Вам запрещается, водителю трамвая разрешается только направо.",
            'num' => '2',
            'question_id' => '430',
        ]);
        $this->insert('option', [
            'id' => '1490',
            'name' => "Вам разрешается прямо или направо, водителю трамвая — запрещается.",
            'num' => '3',
            'question_id' => '430',
        ]);
        $this->insert('option', [
            'id' => '1491',
            'name' => "Вам и водителю трамвая запрещается",
            'num' => '4',
            'question_id' => '430',
        ]);
        $this->insert('option', [
            'id' => '1492',
            'name' => "Только первого.",
            'num' => '1',
            'question_id' => '431',
        ]);
        $this->insert('option', [
            'id' => '1493',
            'name' => "Только первого и второго.",
            'num' => '2',
            'question_id' => '431',
        ]);
        $this->insert('option', [
            'id' => '1494',
            'name' => "Только третьего.",
            'num' => '3',
            'question_id' => '431',
        ]);
        $this->insert('option', [
            'id' => '1495',
            'name' => "Всех изображенных.",
            'num' => '4',
            'question_id' => '431',
        ]);
        $this->insert('option', [
            'id' => '1496',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '432',
        ]);
        $this->insert('option', [
            'id' => '1497',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '432',
        ]);
        $this->insert('option', [
            'id' => '1498',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '432',
        ]);
        $this->insert('option', [
            'id' => '1499',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '432',
        ]);
        $this->insert('option', [
            'id' => '1500',
            'name' => "Только направляющие столбики.",
            'num' => '1',
            'question_id' => '433',
        ]);
        $this->insert('option', [
            'id' => '1501',
            'name' => "Только дорожные ограждения.",
            'num' => '2',
            'question_id' => '433',
        ]);
        $this->insert('option', [
            'id' => '1502',
            'name' => "Только пешеходные ограждения.",
            'num' => '3',
            'question_id' => '433',
        ]);
        $this->insert('option', [
            'id' => '1503',
            'name' => "Все средства, перечисленные выше.",
            'num' => '4',
            'question_id' => '433',
        ]);
        $this->insert('option', [
            'id' => '1504',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '434',
        ]);
        $this->insert('option', [
            'id' => '1505',
            'name' => "Разрешается прямо или направо",
            'num' => '2',
            'question_id' => '434',
        ]);
        $this->insert('option', [
            'id' => '1506',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '434',
        ]);
        $this->insert('option', [
            'id' => '1507',
            'name' => "Вам и водителю трамвая только налево.",
            'num' => '1',
            'question_id' => '435',
        ]);
        $this->insert('option', [
            'id' => '1508',
            'name' => "Вам и водителю трамвая прямо или налево.",
            'num' => '2',
            'question_id' => '435',
        ]);
        $this->insert('option', [
            'id' => '1509',
            'name' => "Вам и водителю трамвая во всех направлениях.",
            'num' => '3',
            'question_id' => '435',
        ]);
        $this->insert('option', [
            'id' => '1510',
            'name' => "Вам во всех направлениях, водителю трамвая — только налево.",
            'num' => '4',
            'question_id' => '435',
        ]);
        $this->insert('option', [
            'id' => '1511',
            'name' => "Разрешается только Вам.",
            'num' => '1',
            'question_id' => '436',
        ]);
        $this->insert('option', [
            'id' => '1512',
            'name' => "Разрешается только водителю трамвая.",
            'num' => '2',
            'question_id' => '436',
        ]);
        $this->insert('option', [
            'id' => '1513',
            'name' => "Разрешается Вам и водителю трамвая.",
            'num' => '3',
            'question_id' => '436',
        ]);
        $this->insert('option', [
            'id' => '1514',
            'name' => "Запрещается Вам и водителю трамвая.",
            'num' => '4',
            'question_id' => '436',
        ]);
        $this->insert('option', [
            'id' => '1515',
            'name' => "Разрешает только поворот налево.",
            'num' => '1',
            'question_id' => '437',
        ]);
        $this->insert('option', [
            'id' => '1516',
            'name' => "Запрещает поворот налево и разворот во всех случаях.",
            'num' => '2',
            'question_id' => '437',
        ]);
        $this->insert('option', [
            'id' => '1517',
            'name' => "Разрешает поворот налево и разворот, если он не запрещен дорожными знаками.",
            'num' => '3',
            'question_id' => '437',
        ]);
        $this->insert('option', [
            'id' => '1518',
            'name' => "Разрешает поворот налево и разворот только при включенном зеленом сигнале в основном светофоре.",
            'num' => '4',
            'question_id' => '437',
        ]);
        $this->insert('option', [
            'id' => '1519',
            'name' => "Разрешается только прямо или налево.",
            'num' => '1',
            'question_id' => '438',
        ]);
        $this->insert('option', [
            'id' => '1520',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '438',
        ]);
        $this->insert('option', [
            'id' => '1521',
            'name' => "Разрешается только налево.",
            'num' => '3',
            'question_id' => '438',
        ]);
        $this->insert('option', [
            'id' => '1522',
            'name' => "Разрешается во всех направлениях.",
            'num' => '4',
            'question_id' => '438',
        ]);
        $this->insert('option', [
            'id' => '1523',
            'name' => "Запрещается.",
            'num' => '5',
            'question_id' => '438',
        ]);
        $this->insert('option', [
            'id' => '1524',
            'name' => "Разрешается, если водитель убедится в отсутствии поезда.",
            'num' => '1',
            'question_id' => '439',
        ]);
        $this->insert('option', [
            'id' => '1525',
            'name' => "Запрещается.",
            'num' => '2',
            'question_id' => '439',
        ]);
        $this->insert('option', [
            'id' => '1526',
            'name' => "Вам и водителю трамвая только налево.",
            'num' => '1',
            'question_id' => '440',
        ]);
        $this->insert('option', [
            'id' => '1527',
            'name' => "Вам и водителю трамвая прямо или налево.",
            'num' => '2',
            'question_id' => '440',
        ]);
        $this->insert('option', [
            'id' => '1528',
            'name' => "Вам и водителю трамвая во всех направлениях.",
            'num' => '3',
            'question_id' => '440',
        ]);
        $this->insert('option', [
            'id' => '1529',
            'name' => "Вам во всех направлениях, водителю трамвая — только налево.",
            'num' => '4',
            'question_id' => '440',
        ]);
        $this->insert('option', [
            'id' => '1530',
            'name' => "Разрешает, но информирует о том, что вскоре будет включен сигнал, запрещающий движение.",
            'num' => '1',
            'question_id' => '441',
        ]);
        $this->insert('option', [
            'id' => '1531',
            'name' => "Запрещает и информирует о предстоящей смене сигнала.",
            'num' => '2',
            'question_id' => '441',
        ]);
        $this->insert('option', [
            'id' => '1532',
            'name' => "Запрещает и информирует о наличии регулируемого пешеходного перехода на пересекаемой дороге.",
            'num' => '3',
            'question_id' => '441',
        ]);
        $this->insert('option', [
            'id' => '1533',
            'name' => "Вам только прямо, водителю трамвая — прямо или налево.",
            'num' => '1',
            'question_id' => '442',
        ]);
        $this->insert('option', [
            'id' => '1534',
            'name' => "Вам и водителю трамвая только прямо.",
            'num' => '2',
            'question_id' => '442',
        ]);
        $this->insert('option', [
            'id' => '1535',
            'name' => "Вам прямо или направо, водителю трамвая — прямо или налево.",
            'num' => '3',
            'question_id' => '442',
        ]);
        $this->insert('option', [
            'id' => '1536',
            'name' => "Вам только прямо, водителю трамвая — только направо.",
            'num' => '4',
            'question_id' => '442',
        ]);
        $this->insert('option', [
            'id' => '1537',
            'name' => "Разрешается только налево или направо.",
            'num' => '1',
            'question_id' => '443',
        ]);
        $this->insert('option', [
            'id' => '1538',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '443',
        ]);
        $this->insert('option', [
            'id' => '1539',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '443',
        ]);
        $this->insert('option', [
            'id' => '1540',
            'name' => "Разрешается только налево или направо.",
            'num' => '1',
            'question_id' => '444',
        ]);
        $this->insert('option', [
            'id' => '1541',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '444',
        ]);
        $this->insert('option', [
            'id' => '1542',
            'name' => "Разрешается налево или на разворот.",
            'num' => '3',
            'question_id' => '444',
        ]);
        $this->insert('option', [
            'id' => '1543',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '444',
        ]);
        $this->insert('option', [
            'id' => '1544',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '445',
        ]);
        $this->insert('option', [
            'id' => '1545',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '445',
        ]);
        $this->insert('option', [
            'id' => '1546',
            'name' => "Разрешается только налево.",
            'num' => '3',
            'question_id' => '445',
        ]);
        $this->insert('option', [
            'id' => '1547',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '445',
        ]);
        $this->insert('option', [
            'id' => '1548',
            'name' => "Тех, вместе с которыми они установлены.",
            'num' => '1',
            'question_id' => '446',
        ]);
        $this->insert('option', [
            'id' => '1549',
            'name' => "Только предупреждающих или запрещающих.",
            'num' => '2',
            'question_id' => '446',
        ]);
        $this->insert('option', [
            'id' => '1550',
            'name' => "Только знаков сервиса.",
            'num' => '3',
            'question_id' => '446',
        ]);
        $this->insert('option', [
            'id' => '1551',
            'name' => "Разрешается только налево.",
            'num' => '1',
            'question_id' => '447',
        ]);
        $this->insert('option', [
            'id' => '1552',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '447',
        ]);
        $this->insert('option', [
            'id' => '1553',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '447',
        ]);
        $this->insert('option', [
            'id' => '1554',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '447',
        ]);
        $this->insert('option', [
            'id' => '1555',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '448',
        ]);
        $this->insert('option', [
            'id' => '1556',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '448',
        ]);
        $this->insert('option', [
            'id' => '1557',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '448',
        ]);
        $this->insert('option', [
            'id' => '1558',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '448',
        ]);
        $this->insert('option', [
            'id' => '1559',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '449',
        ]);
        $this->insert('option', [
            'id' => '1560',
            'name' => "Разрешается только налево или на разворот.",
            'num' => '2',
            'question_id' => '449',
        ]);
        $this->insert('option', [
            'id' => '1561',
            'name' => "Разрешается только налево.",
            'num' => '3',
            'question_id' => '449',
        ]);
        $this->insert('option', [
            'id' => '1562',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '449',
        ]);
        $this->insert('option', [
            'id' => '1563',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '450',
        ]);
        $this->insert('option', [
            'id' => '1564',
            'name' => "Разрешается только налево или на разворот.",
            'num' => '2',
            'question_id' => '450',
        ]);
        $this->insert('option', [
            'id' => '1565',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '450',
        ]);
        $this->insert('option', [
            'id' => '1566',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '450',
        ]);
        $this->insert('option', [
            'id' => '1567',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '451',
        ]);
        $this->insert('option', [
            'id' => '1568',
            'name' => "Разрешается налево или на разворот.",
            'num' => '2',
            'question_id' => '451',
        ]);
        $this->insert('option', [
            'id' => '1569',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '451',
        ]);
        $this->insert('option', [
            'id' => '1570',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '451',
        ]);
        $this->insert('option', [
            'id' => '1571',
            'name' => "Разрешается Вам и водителю трамвая только направо или налево.",
            'num' => '1',
            'question_id' => '452',
        ]);
        $this->insert('option', [
            'id' => '1572',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '2',
            'question_id' => '452',
        ]);
        $this->insert('option', [
            'id' => '1573',
            'name' => "Вам запрещается, водителю трамвая разрешается направо или налево.",
            'num' => '3',
            'question_id' => '452',
        ]);
        $this->insert('option', [
            'id' => '1574',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '452',
        ]);
        $this->insert('option', [
            'id' => '1575',
            'name' => "Только вертикально.",
            'num' => '1',
            'question_id' => '453',
        ]);
        $this->insert('option', [
            'id' => '1576',
            'name' => "Только горизонтально.",
            'num' => '2',
            'question_id' => '453',
        ]);
        $this->insert('option', [
            'id' => '1577',
            'name' => "Вертикально или горизонтально.",
            'num' => '3',
            'question_id' => '453',
        ]);
        $this->insert('option', [
            'id' => '1578',
            'name' => "Только на перекрестках с ограниченной обзорностью.",
            'num' => '1',
            'question_id' => '454',
        ]);
        $this->insert('option', [
            'id' => '1579',
            'name' => "Только в местах с недостаточной обзорностью.",
            'num' => '2',
            'question_id' => '454',
        ]);
        $this->insert('option', [
            'id' => '1580',
            'name' => "В обоих вышеперечисленных случаях.",
            'num' => '3',
            'question_id' => '454',
        ]);
        $this->insert('option', [
            'id' => '1581',
            'name' => "Разрешается только прямо или направо.",
            'num' => '1',
            'question_id' => '455',
        ]);
        $this->insert('option', [
            'id' => '1582',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '455',
        ]);
        $this->insert('option', [
            'id' => '1583',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '455',
        ]);
        $this->insert('option', [
            'id' => '1584',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '455',
        ]);
        $this->insert('option', [
            'id' => '1585',
            'name' => "Требования которых она подчеркивает или уточняет.",
            'num' => '1',
            'question_id' => '456',
        ]);
        $this->insert('option', [
            'id' => '1586',
            'name' => "Требования которых отменяет.",
            'num' => '2',
            'question_id' => '456',
        ]);
        $this->insert('option', [
            'id' => '1587',
            'name' => "Требования которых усиливает.",
            'num' => '3',
            'question_id' => '456',
        ]);
        $this->insert('option', [
            'id' => '1588',
            'name' => "Во всех вышеперечисленных случаях.",
            'num' => '4',
            'question_id' => '456',
        ]);
        $this->insert('option', [
            'id' => '1589',
            'name' => "Вам и водителю трамвая разрешается только прямо.",
            'num' => '1',
            'question_id' => '457',
        ]);
        $this->insert('option', [
            'id' => '1590',
            'name' => "Вам разрешается прямо, налево или на разворот, водителю трамвая — прямо или направо.",
            'num' => '2',
            'question_id' => '457',
        ]);
        $this->insert('option', [
            'id' => '1591',
            'name' => "Вам и водителю трамвая разрешается только налево.",
            'num' => '3',
            'question_id' => '457',
        ]);
        $this->insert('option', [
            'id' => '1592',
            'name' => "Вам запрещается, водителю трамвая разрешается только прямо.",
            'num' => '4',
            'question_id' => '457',
        ]);
        $this->insert('option', [
            'id' => '1593',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '458',
        ]);
        $this->insert('option', [
            'id' => '1594',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '458',
        ]);
        $this->insert('option', [
            'id' => '1595',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '458',
        ]);
        $this->insert('option', [
            'id' => '1596',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '458',
        ]);
        $this->insert('option', [
            'id' => '1597',
            'name' => "Разрешается Вам и водителю трамвая прямо или налево.",
            'num' => '1',
            'question_id' => '459',
        ]);
        $this->insert('option', [
            'id' => '1598',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '2',
            'question_id' => '459',
        ]);
        $this->insert('option', [
            'id' => '1599',
            'name' => "Разрешается водителю трамвая прямо или налево, Вам — запрещается.",
            'num' => '3',
            'question_id' => '459',
        ]);
        $this->insert('option', [
            'id' => '1600',
            'name' => "Разрешается Вам только направо, водителю трамвая — прямо или налево.",
            'num' => '4',
            'question_id' => '459',
        ]);
        $this->insert('option', [
            'id' => '1601',
            'name' => "Разрешается только налево или направо.",
            'num' => '1',
            'question_id' => '460',
        ]);
        $this->insert('option', [
            'id' => '1602',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '460',
        ]);
        $this->insert('option', [
            'id' => '1603',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '460',
        ]);
        $this->insert('option', [
            'id' => '1604',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '460',
        ]);
        $this->insert('option', [
            'id' => '1605',
            'name' => "Разрешается Вам только направо, водителю трамвая — во всех направлениях.",
            'num' => '1',
            'question_id' => '461',
        ]);
        $this->insert('option', [
            'id' => '1606',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '2',
            'question_id' => '461',
        ]);
        $this->insert('option', [
            'id' => '1607',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '3',
            'question_id' => '461',
        ]);
        $this->insert('option', [
            'id' => '1608',
            'name' => "Предупреждает о приближении поезда.",
            'num' => '1',
            'question_id' => '462',
        ]);
        $this->insert('option', [
            'id' => '1609',
            'name' => "Показывает, что сигнализация исправна и движение транспортных средств не запрещает.",
            'num' => '2',
            'question_id' => '462',
        ]);
        $this->insert('option', [
            'id' => '1610',
            'name' => "Информирует, что начинает опускаться шлагбаум.",
            'num' => '3',
            'question_id' => '462',
        ]);
        $this->insert('option', [
            'id' => '1611',
            'name' => "Запрещает движение транспортных средств через переезд.",
            'num' => '4',
            'question_id' => '462',
        ]);
        $this->insert('option', [
            'id' => '1612',
            'name' => "Разрешается только прямо или направо.",
            'num' => '1',
            'question_id' => '463',
        ]);
        $this->insert('option', [
            'id' => '1613',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '463',
        ]);
        $this->insert('option', [
            'id' => '1614',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '463',
        ]);
        $this->insert('option', [
            'id' => '1615',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '463',
        ]);
        $this->insert('option', [
            'id' => '1616',
            'name' => "Вам и водителю трамвая разрешается только прямо.",
            'num' => '1',
            'question_id' => '464',
        ]);
        $this->insert('option', [
            'id' => '1617',
            'name' => "Вам и водителю трамвая разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '464',
        ]);
        $this->insert('option', [
            'id' => '1618',
            'name' => "Вам разрешается во всех направлениях, водителю трамвая — запрещается.",
            'num' => '3',
            'question_id' => '464',
        ]);
        $this->insert('option', [
            'id' => '1619',
            'name' => "Вам разрешается только прямо или налево, водителю трамвая — запрещается.",
            'num' => '4',
            'question_id' => '464',
        ]);
        $this->insert('option', [
            'id' => '1620',
            'name' => "Только белого цвета.",
            'num' => '1',
            'question_id' => '465',
        ]);
        $this->insert('option', [
            'id' => '1621',
            'name' => "Только черного цвета.",
            'num' => '2',
            'question_id' => '465',
        ]);
        $this->insert('option', [
            'id' => '1622',
            'name' => "Белого и черного цвета.",
            'num' => '3',
            'question_id' => '465',
        ]);
        $this->insert('option', [
            'id' => '1623',
            'name' => "Белого, черного и желтого цвета.",
            'num' => '4',
            'question_id' => '465',
        ]);
        $this->insert('option', [
            'id' => '1624',
            'name' => "Разрешается только прямо или направо.",
            'num' => '1',
            'question_id' => '466',
        ]);
        $this->insert('option', [
            'id' => '1625',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '466',
        ]);
        $this->insert('option', [
            'id' => '1626',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '466',
        ]);
        $this->insert('option', [
            'id' => '1627',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '466',
        ]);
        $this->insert('option', [
            'id' => '1628',
            'name' => "Разрешает движение по полосе, над которой он расположен.",
            'num' => '1',
            'question_id' => '467',
        ]);
        $this->insert('option', [
            'id' => '1629',
            'name' => "Запрещает движение по полосе, над которой он расположен.",
            'num' => '2',
            'question_id' => '467',
        ]);
        $this->insert('option', [
            'id' => '1630',
            'name' => "Обязывает двигаться лишь по полосе, на которую указывает стрелка.",
            'num' => '3',
            'question_id' => '467',
        ]);
        $this->insert('option', [
            'id' => '1631',
            'name' => "Разрешается Вам и водителю трамвая только направо.",
            'num' => '1',
            'question_id' => '468',
        ]);
        $this->insert('option', [
            'id' => '1632',
            'name' => "Разрешается Вам и водителю трамвая только прямо.",
            'num' => '2',
            'question_id' => '468',
        ]);
        $this->insert('option', [
            'id' => '1633',
            'name' => "Разрешается Вам прямо или направо, водителю трамвая — только прямо.",
            'num' => '3',
            'question_id' => '468',
        ]);
        $this->insert('option', [
            'id' => '1634',
            'name' => "Запрещается Вам и водителю трамвая.",
            'num' => '4',
            'question_id' => '468',
        ]);
        $this->insert('option', [
            'id' => '1635',
            'name' => "Разрешается только налево.",
            'num' => '1',
            'question_id' => '469',
        ]);
        $this->insert('option', [
            'id' => '1636',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '469',
        ]);
        $this->insert('option', [
            'id' => '1637',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '469',
        ]);
        $this->insert('option', [
            'id' => '1638',
            'name' => "Не изменяют значения этих сигналов и информируют водителей о разрешенных направлениях движения при зеленом сигнале.",
            'num' => '1',
            'question_id' => '470',
        ]);
        $this->insert('option', [
            'id' => '1639',
            'name' => "Разрешают движение транспортных средств в направлении стрелки при условии беспрепятственного пропуска транспортных средств, движущихся с других направлений.",
            'num' => '2',
            'question_id' => '470',
        ]);
        $this->insert('option', [
            'id' => '1640',
            'name' => "Только водителю легкового автомобиля.",
            'num' => '1',
            'question_id' => '471',
        ]);
        $this->insert('option', [
            'id' => '1641',
            'name' => "Только водителю мотоцикла.",
            'num' => '2',
            'question_id' => '471',
        ]);
        $this->insert('option', [
            'id' => '1642',
            'name' => "Водителям обоих транспортных средств.",
            'num' => '3',
            'question_id' => '471',
        ]);
        $this->insert('option', [
            'id' => '1643',
            'name' => "Разрешается Вам и водителю трамвая только прямо или налево.",
            'num' => '1',
            'question_id' => '472',
        ]);
        $this->insert('option', [
            'id' => '1644',
            'name' => "Разрешается Вам во всех направлениях, водителю трамвая — только налево.",
            'num' => '2',
            'question_id' => '472',
        ]);
        $this->insert('option', [
            'id' => '1645',
            'name' => "Разрешается Вам и водителю трамвая только налево.",
            'num' => '3',
            'question_id' => '472',
        ]);
        $this->insert('option', [
            'id' => '1646',
            'name' => "Вам и водителю трамвая запрещается.",
            'num' => '4',
            'question_id' => '472',
        ]);
        $this->insert('option', [
            'id' => '1647',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '473',
        ]);
        $this->insert('option', [
            'id' => '1648',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '473',
        ]);
        $this->insert('option', [
            'id' => '1649',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '473',
        ]);
        $this->insert('option', [
            'id' => '1650',
            'name' => "Вам разрешается во всех направлениях, водителю трамвая — запрещается.",
            'num' => '1',
            'question_id' => '474',
        ]);
        $this->insert('option', [
            'id' => '1651',
            'name' => "Вам разрешается только налево, водителю трамвая — направо или налево.",
            'num' => '2',
            'question_id' => '474',
        ]);
        $this->insert('option', [
            'id' => '1652',
            'name' => "Вам разрешается во всех направлениях, водителю трамвая — только налево.",
            'num' => '3',
            'question_id' => '474',
        ]);
        $this->insert('option', [
            'id' => '1653',
            'name' => "Вам и водителю трамвая разрешается во всех направлениях.",
            'num' => '4',
            'question_id' => '474',
        ]);
        $this->insert('option', [
            'id' => '1654',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '475',
        ]);
        $this->insert('option', [
            'id' => '1655',
            'name' => "Разрешается направо или налево.",
            'num' => '2',
            'question_id' => '475',
        ]);
        $this->insert('option', [
            'id' => '1656',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '475',
        ]);
        $this->insert('option', [
            'id' => '1657',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '475',
        ]);
        $this->insert('option', [
            'id' => '1658',
            'name' => "Только ограждения и световое сигнальное оборудование в местах дорожных работ.",
            'num' => '1',
            'question_id' => '476',
        ]);
        $this->insert('option', [
            'id' => '1659',
            'name' => "Только предупреждающие световые тумбы на островках безопасности.",
            'num' => '2',
            'question_id' => '476',
        ]);
        $this->insert('option', [
            'id' => '1660',
            'name' => "Средства, перечисленные выше, а также выпуклые зеркала.",
            'num' => '3',
            'question_id' => '476',
        ]);
        $this->insert('option', [
            'id' => '1661',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '477',
        ]);
        $this->insert('option', [
            'id' => '1662',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '477',
        ]);
        $this->insert('option', [
            'id' => '1663',
            'name' => "Разрешается только налево.",
            'num' => '3',
            'question_id' => '477',
        ]);
        $this->insert('option', [
            'id' => '1664',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '477',
        ]);
        $this->insert('option', [
            'id' => '1665',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '478',
        ]);
        $this->insert('option', [
            'id' => '1666',
            'name' => "Разрешается только налево или на разворот.",
            'num' => '2',
            'question_id' => '478',
        ]);
        $this->insert('option', [
            'id' => '1667',
            'name' => "Разрешается только прямо, налево или на разворот.",
            'num' => '3',
            'question_id' => '478',
        ]);
        $this->insert('option', [
            'id' => '1668',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '478',
        ]);
        $this->insert('option', [
            'id' => '1669',
            'name' => "Только синего автомобиля.",
            'num' => '1',
            'question_id' => '479',
        ]);
        $this->insert('option', [
            'id' => '1670',
            'name' => "Трамвая и белого автомобиля.",
            'num' => '2',
            'question_id' => '479',
        ]);
        $this->insert('option', [
            'id' => '1671',
            'name' => "Только мотоцикла.",
            'num' => '3',
            'question_id' => '479',
        ]);
        $this->insert('option', [
            'id' => '1672',
            'name' => "Только белого автомобиля.",
            'num' => '4',
            'question_id' => '479',
        ]);
        $this->insert('option', [
            'id' => '1673',
            'name' => "Трамвая и синего автомобиля.",
            'num' => '5',
            'question_id' => '479',
        ]);
        $this->insert('option', [
            'id' => '1674',
            'name' => "Разрешается, если полоса расположена слева.",
            'num' => '1',
            'question_id' => '480',
        ]);
        $this->insert('option', [
            'id' => '1675',
            'name' => "Запрещается.",
            'num' => '2',
            'question_id' => '480',
        ]);
        $this->insert('option', [
            'id' => '1676',
            'name' => "Разрешается только для выполнения опережения.",
            'num' => '3',
            'question_id' => '480',
        ]);
        $this->insert('option', [
            'id' => '1677',
            'name' => "Разрешается Вам и водителю трамвая только прямо.",
            'num' => '1',
            'question_id' => '481',
        ]);
        $this->insert('option', [
            'id' => '1678',
            'name' => "Вам запрещается, водителю трамвая разрешается только прямо.",
            'num' => '2',
            'question_id' => '481',
        ]);
        $this->insert('option', [
            'id' => '1679',
            'name' => "Разрешается водителю трамвая только налево. Вам — запрещается.",
            'num' => '3',
            'question_id' => '481',
        ]);
        $this->insert('option', [
            'id' => '1680',
            'name' => "Разрешается Вам только налево, водителю трамвая — только прямо.",
            'num' => '4',
            'question_id' => '481',
        ]);
        $this->insert('option', [
            'id' => '1681',
            'name' => "Разрешается только направо или налево.",
            'num' => '1',
            'question_id' => '482',
        ]);
        $this->insert('option', [
            'id' => '1682',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '482',
        ]);
        $this->insert('option', [
            'id' => '1683',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '482',
        ]);
        $this->insert('option', [
            'id' => '1684',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '483',
        ]);
        $this->insert('option', [
            'id' => '1685',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '483',
        ]);
        $this->insert('option', [
            'id' => '1686',
            'name' => "Разрешается налево или на разворот.",
            'num' => '3',
            'question_id' => '483',
        ]);
        $this->insert('option', [
            'id' => '1687',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '483',
        ]);
        $this->insert('option', [
            'id' => '1688',
            'name' => "Только второго и третьего.",
            'num' => '1',
            'question_id' => '484',
        ]);
        $this->insert('option', [
            'id' => '1689',
            'name' => "Только первого.",
            'num' => '2',
            'question_id' => '484',
        ]);
        $this->insert('option', [
            'id' => '1690',
            'name' => "Второго, третьего и четвертого.",
            'num' => '3',
            'question_id' => '484',
        ]);
        $this->insert('option', [
            'id' => '1691',
            'name' => "Только второго и четвертого.",
            'num' => '4',
            'question_id' => '484',
        ]);
        $this->insert('option', [
            'id' => '1692',
            'name' => "Всех изображенных.",
            'num' => '5',
            'question_id' => '484',
        ]);
        $this->insert('option', [
            'id' => '1693',
            'name' => "Сигнал красного цвета — снизу, зеленого — сверху.",
            'num' => '1',
            'question_id' => '485',
        ]);
        $this->insert('option', [
            'id' => '1694',
            'name' => "Сигнал красного цвета — сверху, зеленого — снизу.",
            'num' => '2',
            'question_id' => '485',
        ]);
        $this->insert('option', [
            'id' => '1695',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '486',
        ]);
        $this->insert('option', [
            'id' => '1696',
            'name' => "Разрешается во всех направлениях.",
            'num' => '2',
            'question_id' => '486',
        ]);
        $this->insert('option', [
            'id' => '1697',
            'name' => "Запрещается.",
            'num' => '3',
            'question_id' => '486',
        ]);
        $this->insert('option', [
            'id' => '1698',
            'name' => "Вам только направо, водителю трамвая — прямо или налево.",
            'num' => '1',
            'question_id' => '487',
        ]);
        $this->insert('option', [
            'id' => '1699',
            'name' => "Вам и водителю трамвая только прямо.",
            'num' => '2',
            'question_id' => '487',
        ]);
        $this->insert('option', [
            'id' => '1700',
            'name' => "Вам прямо или направо, водителю трамвая — прямо или налево.",
            'num' => '3',
            'question_id' => '487',
        ]);
        $this->insert('option', [
            'id' => '1701',
            'name' => "Вам и водителю трамвая только направо.",
            'num' => '4',
            'question_id' => '487',
        ]);
        $this->insert('option', [
            'id' => '1702',
            'name' => "Разрешается только налево или направо.",
            'num' => '1',
            'question_id' => '488',
        ]);
        $this->insert('option', [
            'id' => '1703',
            'name' => "Разрешается только направо.",
            'num' => '2',
            'question_id' => '488',
        ]);
        $this->insert('option', [
            'id' => '1704',
            'name' => "Разрешается во всех направлениях.",
            'num' => '3',
            'question_id' => '488',
        ]);
        $this->insert('option', [
            'id' => '1705',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '488',
        ]);
        $this->insert('option', [
            'id' => '1706',
            'name' => "Вам и водителю трамвая только прямо или направо.",
            'num' => '1',
            'question_id' => '489',
        ]);
        $this->insert('option', [
            'id' => '1707',
            'name' => "Вам и водителю трамвая только прямо.",
            'num' => '2',
            'question_id' => '489',
        ]);
        $this->insert('option', [
            'id' => '1708',
            'name' => "Вам прямо или направо, водителю трамвая — только прямо.",
            'num' => '3',
            'question_id' => '489',
        ]);
        $this->insert('option', [
            'id' => '1709',
            'name' => "Вам во всех направлениях, водителю трамвая — только прямо",
            'num' => '4',
            'question_id' => '489',
        ]);
        $this->insert('option', [
            'id' => '1710',
            'name' => "Разрешается только прямо.",
            'num' => '1',
            'question_id' => '490',
        ]);
        $this->insert('option', [
            'id' => '1711',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '490',
        ]);
        $this->insert('option', [
            'id' => '1712',
            'name' => "Разрешается только направо.",
            'num' => '3',
            'question_id' => '490',
        ]);
        $this->insert('option', [
            'id' => '1713',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '490',
        ]);
        $this->insert('option', [
            'id' => '1714',
            'name' => "Устанавливает определенные режимы и порядок движения.",
            'num' => '1',
            'question_id' => '491',
        ]);
        $this->insert('option', [
            'id' => '1715',
            'name' => "Отменяет или уточняет требования запрещающих дорожных знаков.",
            'num' => '2',
            'question_id' => '491',
        ]);
        $this->insert('option', [
            'id' => '1716',
            'name' => "Информирует об опасном участке и режиме движения на нем.",
            'num' => '3',
            'question_id' => '491',
        ]);
        $this->insert('option', [
            'id' => '1717',
            'name' => "Изображенный слева.",
            'num' => '1',
            'question_id' => '492',
        ]);
        $this->insert('option', [
            'id' => '1718',
            'name' => "Изображенный справа.",
            'num' => '2',
            'question_id' => '492',
        ]);
        $this->insert('option', [
            'id' => '1719',
            'name' => "Вам и водителю трамвая только прямо.",
            'num' => '1',
            'question_id' => '493',
        ]);
        $this->insert('option', [
            'id' => '1720',
            'name' => "Вам прямо или направо, водителю трамвая — прямо или налево.",
            'num' => '2',
            'question_id' => '493',
        ]);
        $this->insert('option', [
            'id' => '1721',
            'name' => "Вам прямо, водителю трамвая — только налево.",
            'num' => '3',
            'question_id' => '493',
        ]);
        $this->insert('option', [
            'id' => '1722',
            'name' => "Вам и водителю трамвая прямо или направо.",
            'num' => '4',
            'question_id' => '493',
        ]);
        $this->insert('option', [
            'id' => '1723',
            'name' => "Только верхнего.",
            'num' => '1',
            'question_id' => '494',
        ]);
        $this->insert('option', [
            'id' => '1724',
            'name' => "Только нижнего.",
            'num' => '2',
            'question_id' => '494',
        ]);
        $this->insert('option', [
            'id' => '1725',
            'name' => "Обоих.",
            'num' => '3',
            'question_id' => '494',
        ]);
        $this->insert('option', [
            'id' => '1726',
            'name' => "Разрешается только направо.",
            'num' => '1',
            'question_id' => '495',
        ]);
        $this->insert('option', [
            'id' => '1727',
            'name' => "Разрешается только прямо или направо.",
            'num' => '2',
            'question_id' => '495',
        ]);
        $this->insert('option', [
            'id' => '1728',
            'name' => "Разрешается только прямо.",
            'num' => '3',
            'question_id' => '495',
        ]);
        $this->insert('option', [
            'id' => '1729',
            'name' => "Запрещается.",
            'num' => '4',
            'question_id' => '495',
        ]);
        $this->insert('option', [
            'id' => '1730',
            'name' => "",
            'num' => '1',
            'question_id' => '496',
        ]);
        $this->insert('option', [
            'id' => '1731',
            'name' => "",
            'num' => '2',
            'question_id' => '496',
        ]);
        $this->insert('option', [
            'id' => '1732',
            'name' => "",
            'num' => '3',
            'question_id' => '496',
        ]);
        $this->insert('option', [
            'id' => '1733',
            'name' => "Разрешается.",
            'num' => '1',
            'question_id' => '497',
        ]);
        $this->insert('option', [
            'id' => '1734',
            'name' => "Запрещается.",
            'num' => '2',
            'question_id' => '497',
        ]);
        $this->insert('option', [
            'id' => '1735',
            'name' => "Должны дождаться разрешающего сигнала светофора.",
            'num' => '1',
            'question_id' => '498',
        ]);
        $this->insert('option', [
            'id' => '1736',
            'name' => "Имеете преимущество в движении.",
            'num' => '2',
            'question_id' => '498',
        ]);
        $this->insert('option', [
            'id' => '1737',
            'name' => "Должны уступить дорогу всем участникам движения.",
            'num' => '3',
            'question_id' => '498',
        ]);
    }

    public function down()
    {
        $query = (new Query())->select('id')->from('question')->where(['chapter_id' => 8])->all();
        $questionIDs = [];
        foreach ($query as $key => $val) {
            $questionIDs[] = $val['id'];
        }
        $this->delete('option', ['in', 'question_id', $questionIDs]);
    }
}
