<?php

use yii\db\Schema;
use yii\db\Migration;

class m150404_213131_populate_chapter2_question_table extends Migration
{
    public function up()
    {
        $this->insert('question', [
            'id' => '109',
            'name' => "Якщо під нас дорожньо-транспортної пригоди пошкоджено лише застраховані транспортні засоби та немає загиблих і травмованих, за взаємною згодою учасників пригоди допускається:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '1',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '110',
            'name' => "Які документи повинен пред’явити працівникові міліції для перевірки водій легкового автомобіля?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '2',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '111',
            'name' => "Водій повинен надавати транспортний засіб для доставлення до найближчого лікувального закладу осіб, які потребують невідкладної медичної допомоги:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '3',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '112',
            'name' => "Що з переліченого у відповідях повинен виконати в першу чергу водій, який став учасником дорожньо-транспортної пригоди, в якій постраждали люди?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '4',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '113',
            'name' => "Кому з перелічених дозволено перебувати в транспортному засобі й не пристібатися ременем безпеки під час руху в населеному пункті, якщо транспортний засіб обладнано ними?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '5',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '114',
            'name' => "Водієві заборонено передавати керування транспортним засобом особам, які перебувають у стані алкогольного сп’яніння або під впливом наркотичних чи токсичних речовин:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '6',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '115',
            'name' => "Водій-інвалід, що керує мотоколяскою чи автомобілем, позначеними розпізнавальним знаком «інвалід», може відступати від вимог дорожніх знаків:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '7',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '116',
            'name' => "Які з перелічених додаткові документи повинен мати при собі водій механічного транспортного засобу, що перевозить великогабаритний або великоваговий вантаж?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '8',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '117',
            'name' => "Які з перелічених у відповідях дії повинен виконати водій, причетний до дорожньо-транспортної пригоди?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '9',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '118',
            'name' => "У місці здійснення габаритно-вагового контролю на вимогу працівника пункту габаритно-вагового контролю або працівника МВС водій вантажного автомобіля повинен:",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '10',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '119',
            'name' => "Водій - власник транспортного засобу має право:",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '11',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '120',
            'name' => "Які з перелічених дій повинен у першу чергу виконати водійі у разі скоєння дорожньо-транспортної пригоди?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '12',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '121',
            'name' => "Хто згідно з вимогами Правил у цьому випадку зобов'язаний користуватися ременем безпеки?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '13',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '122',
            'name' => "Власник транспортного засобу, а також особа, яка використовує такий транспортний засіб на законних підставах, можуть передавати керування транспортним засобом іншій особі:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '14',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '123',
            'name' => "Власник транспортного засобу має право на відшкодування збитків, завданих внаслідок невідповідності вимогам безпеки руху стану:",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '15',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '124',
            'name' => "Водієві заборонено керувати транспортним засобом під впливом лікарських препаратів:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '16',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '125',
            'name' => "Право на керування автомобілями, колісними тракторами і іншими механізмами, що експлуатуються на вулично шляховій мережі, за винятком автобусів, трамваїв тролейбусів, надається з:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '17',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '126',
            'name' => "Для забезпечення безпеки дорожнього руху водій зобов'язаний:",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '18',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '127',
            'name' => "Водій повинен пройти медичний огляд для визначення стану алкогольного сп'яніння на вимогу:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '19',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '128',
            'name' => "Передавати керування транспортним засобом особі, яка не має посвідчення на право керування ним, дозволено:",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '20',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '129',
            'name' => "Згідно з вимогами Правил водій, причетний до дорожньо транспортної пригоди, зобов'язаний повідомити про неї в:",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '21',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '130',
            'name' => "У разі виявлення під час здійснення габаритно-вагового контролю невідповідності фактичних вагових та/або габаритних параметрів установленим нормам і правилам, рух такого транспортного засобу та/або причепу:",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '22',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '131',
            'name' => "Під час руху транспортного засобу користуватися засобами зв’язку, тримаючи їх у руці, дозволяється водію:",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '23',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '132',
            'name' => "Які з перелічених документів повинен мати при собі водій механічного транспортного засобу?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '24',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '133',
            'name' => "Водій якого транспортного засобу повинен надавати його працівнику міліції для транспортування пошкоджених транспортних засобів?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '25',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '134',
            'name' => "Право на керування мототранспортними засобами і мотоколясками надається з:",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '26',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '135',
            'name' => "Водію забороняється керувати транспортним засобом у стані:",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '27',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '136',
            'name' => "Які документи з перелічених повинен водій пред'являти працівнику міліції для перевірки?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '28',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '137',
            'name' => "Водію-інваліду, який керує мотоколяскою або автомобілем, позначеними розпізнавальним знаком «Інвалід», зупиняти транспортний засіб у зоні дії дорожнього знака «Зупинку заборонено» з табличкою «Крім інвалідів»:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '29',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '138',
            'name' => "Якщо внаслідок дорожньо-транспортної пригоди немає потерпілих і не нанесені матеріальні збитки третім особам, а транспортні засоби можуть безпечно рухатися, водії (за наявності взаємної згоди в оцінці обставин скоєного) можуть:",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '30',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '139',
            'name' => "Право на керування автомобілями з причепами або напівпричепами, а також тими, що призначені для перевезення великогабаритних, великовагових і небезпечних вантажів, надається з:",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '31',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '140',
            'name' => "Що з переліченого у відповідях повинен виконати в пери чергу водій, причетний до дорожньо-транспортної пригоди з постраждалими людьми?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '32',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '141',
            'name' => "Які з перелічених додаткових документів повинен мати при собі водій механічного транспортного засобу, що перевозить небезпечний вантаж?",
            'correct_option' => '5',
            'rule_reference' => '',
            'num' => '33',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '142',
            'name' => "Водієві заборонено керувати транспортним засобом:",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '34',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '143',
            'name' => "Для забезпечення безпеки дорожнього руху водій перед виїздом зобов’язаний:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '35',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '144',
            'name' => "Водій повинен надавати транспортний засіб працівнику міліції:",
            'correct_option' => '5',
            'rule_reference' => '',
            'num' => '36',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '145',
            'name' => "Водій має право:",
            'correct_option' => '5',
            'rule_reference' => '',
            'num' => '37',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '146',
            'name' => "Водій якого автомобіля-таксі порушує Правила, перевозячи пасажирів, не пристебнутих ременями безпеки?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '38',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '147',
            'name' => "Чи зобов’язаний водій на вимогу працівника міліції дати можливість перевірити номери агрегатів і комплектність транспортного засобу?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '39',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '148',
            'name' => "Згідно вимог Правил водій зобов’язаний пройти позачергове медичний огляд, перевірку знань Правил і навичок водіння за рішенням:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '40',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '149',
            'name' => "Власник транспортного засобу має право:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '41',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '150',
            'name' => "Для забезпечення безпеки дорожнього руху водій мотоцикла зобов’язаний:",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '42',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '151',
            'name' => "У разі неможливості викликати на місце дорожньо-транспортної пригоди карету швидкої медичної допомоги та відправлення потерпілого до лікувальної установи іншим транспортним засобом водій, причетний до ДТП, зобов’язаний:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '43',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '152',
            'name' => "Кому з перелічених дозволено перебувати в транспортному засобі з непристебнутими ременями безпеки під час руху поза населеним пунктом, якщо транспортний засіб обладнано ними?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '44',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '153',
            'name' => "Водій якого автомобіля порушив Правила, зупинившись на цій ділянці дороги?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '45',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '154',
            'name' => "Які з перелічених обов’язків із забезпечення безпеки дорожнього руху покладаються на водія?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '46',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '155',
            'name' => "За яких умов водії застрахованих транспортних засобів можуть не повідомляти про дорожньо-транспортну пригоду орган чи підрозділ міліції?",
            'correct_option' => '5',
            'rule_reference' => '',
            'num' => '47',
            'chapter_id' => '2',
        ]);
        $this->insert('question', [
            'id' => '156',
            'name' => "Правила забороняють водієві керувати транспортним засобом з номерним знаком, що:",
            'correct_option' => '5',
            'rule_reference' => '',
            'num' => '48',
            'chapter_id' => '2',
        ]);
    }

    public function down()
    {
        $this->delete('question', ['chapter_id' => '2']);
    }
}
