<?php

use yii\db\Schema;
use yii\db\Migration;
use yii\db\Query;

class m150404_213141_populate_chapter2_option_table extends Migration
{
    public function up()
    {
        $this->insert('option', [
            'id' => '373',
            'name' => "Скласти спільне повідомлення про дорожньо-транспортну пригоду відповідно до встановленого зразка.",
            'num' => '1',
            'question_id' => '109',
        ]);
        $this->insert('option', [
            'id' => '374',
            'name' => "Зафіксувати пошкодження транспортних засобів і після підпису учасниками події передати матеріали до страхової організації для їх подальшого оформлення.",
            'num' => '2',
            'question_id' => '109',
        ]);
        $this->insert('option', [
            'id' => '375',
            'name' => "Здійснити обмін страховими полісами і роз'їхатися.",
            'num' => '3',
            'question_id' => '109',
        ]);
        $this->insert('option', [
            'id' => '376',
            'name' => "Виконати будь-яку з перелічених вище дій.",
            'num' => '4',
            'question_id' => '109',
        ]);
        $this->insert('option', [
            'id' => '377',
            'name' => "Тільки посвідчення на право керування транспортним засобом.",
            'num' => '1',
            'question_id' => '110',
        ]);
        $this->insert('option', [
            'id' => '378',
            'name' => "Тільки реєстраційний документ на транспортний засіб.",
            'num' => '2',
            'question_id' => '110',
        ]);
        $this->insert('option', [
            'id' => '379',
            'name' => "Тільки поліс страхування цивільно-правової відповідальності.",
            'num' => '3',
            'question_id' => '110',
        ]);
        $this->insert('option', [
            'id' => '380',
            'name' => "Усе перелічені вище документи.",
            'num' => '4',
            'question_id' => '110',
        ]);
        $this->insert('option', [
            'id' => '381',
            'name' => "Тільки документи, перелічені у відповідях 1 і 2.",
            'num' => '5',
            'question_id' => '110',
        ]);
        $this->insert('option', [
            'id' => '382',
            'name' => "Тільки працівникам міліції.",
            'num' => '1',
            'question_id' => '111',
        ]);
        $this->insert('option', [
            'id' => '383',
            'name' => "Тільки працівникам охорони здоров'я.",
            'num' => '2',
            'question_id' => '111',
        ]);
        $this->insert('option', [
            'id' => '384',
            'name' => "Працівникам міліції та охорони здоров'я.",
            'num' => '3',
            'question_id' => '111',
        ]);
        $this->insert('option', [
            'id' => '385',
            'name' => "Повідомити в органи міліції про подію.",
            'num' => '1',
            'question_id' => '112',
        ]);
        $this->insert('option', [
            'id' => '386',
            'name' => "Викликати карету швидкої медичної допомоги.",
            'num' => '2',
            'question_id' => '112',
        ]);
        $this->insert('option', [
            'id' => '387',
            'name' => "Записати прізвища й адреси очевидців.",
            'num' => '3',
            'question_id' => '112',
        ]);
        $this->insert('option', [
            'id' => '388',
            'name' => "Тільки особі, яка навчає водінню в транспортному засобі, якщо за кермом учень.",
            'num' => '1',
            'question_id' => '113',
        ]);
        $this->insert('option', [
            'id' => '389',
            'name' => "Тільки водіям і пасажирам оперативних та спеціальних транспортних засобів і таксі.",
            'num' => '2',
            'question_id' => '113',
        ]);
        $this->insert('option', [
            'id' => '390',
            'name' => "Тільки водіям-інвалідам.",
            'num' => '3',
            'question_id' => '113',
        ]);
        $this->insert('option', [
            'id' => '391',
            'name' => "Усім названим вище особам.",
            'num' => '4',
            'question_id' => '113',
        ]);
        $this->insert('option', [
            'id' => '392',
            'name' => "У всіх випадках.",
            'num' => '1',
            'question_id' => '114',
        ]);
        $this->insert('option', [
            'id' => '393',
            'name' => "Крім випадків доставення до лікувального закладу осіб, які потребують невідкладної медичної допомоги.",
            'num' => '2',
            'question_id' => '114',
        ]);
        $this->insert('option', [
            'id' => '394',
            'name' => "Крім випадків транспортування пошкоджених транспортних засобів.",
            'num' => '3',
            'question_id' => '114',
        ]);
        $this->insert('option', [
            'id' => '395',
            'name' => "«Перевага зустрічного руху»",
            'num' => '1',
            'question_id' => '115',
        ]);
        $this->insert('option', [
            'id' => '396',
            'name' => "«В'їзд заборонено» і «Обмеження мінімальної швидкості».",
            'num' => '2',
            'question_id' => '115',
        ]);
        $this->insert('option', [
            'id' => '397',
            'name' => "«Рух заборонено», «Рух механічних транспортних засобів заборонено», «Стоянку заборонено».",
            'num' => '3',
            'question_id' => '115',
        ]);
        $this->insert('option', [
            'id' => '398',
            'name' => "Будь-яких перелічених вище.",
            'num' => '4',
            'question_id' => '115',
        ]);
        $this->insert('option', [
            'id' => '399',
            'name' => "Технічні умови на перевезення.",
            'num' => '1',
            'question_id' => '116',
        ]);
        $this->insert('option', [
            'id' => '400',
            'name' => "Свідоцтво про допуск водія і допуск транспортного засобу до перевезення.",
            'num' => '2',
            'question_id' => '116',
        ]);
        $this->insert('option', [
            'id' => '401',
            'name' => "Дозвіл на рух.",
            'num' => '3',
            'question_id' => '116',
        ]);
        $this->insert('option', [
            'id' => '402',
            'name' => "Усі перелічені вище документи.",
            'num' => '4',
            'question_id' => '116',
        ]);
        $this->insert('option', [
            'id' => '403',
            'name' => "Негайно зупинити транспортний засіб і залишатися на місці пригоди.",
            'num' => '1',
            'question_id' => '117',
        ]);
        $this->insert('option', [
            'id' => '404',
            'name' => "Ввімкнути аварійну світлову сигналізацію і виставити знак аварійної зупинки.",
            'num' => '2',
            'question_id' => '117',
        ]);
        $this->insert('option', [
            'id' => '405',
            'name' => "Повідомити про пригоду в І орган міліції і чекати прибуття його працівників.",
            'num' => '3',
            'question_id' => '117',
        ]);
        $this->insert('option', [
            'id' => '406',
            'name' => "Виконати всі перелічені дії.",
            'num' => '4',
            'question_id' => '117',
        ]);
        $this->insert('option', [
            'id' => '407',
            'name' => "Зупинитися з дотриманням вимог Правил.",
            'num' => '1',
            'question_id' => '118',
        ]);
        $this->insert('option', [
            'id' => '408',
            'name' => "Передати для перевірки посвідчення на право керування транспортним засобом відповідної категорії, реєстраційний документ на транспортний засіб або свідоцтво про право спільної власності на цей транспортний засіб або тимчасовий реєстраційний талон, шляховий лист і документи на вантаж, що перевозиться, дозвіл на рух, технічні умови на перевезення, свідоцтво про допуск водія і допуск транспортного засобу до перевезення небезпечного вантажу та дозвіл на дорожнє перевезення.",
            'num' => '2',
            'question_id' => '118',
        ]);
        $this->insert('option', [
            'id' => '409',
            'name' => "Надати транспортний засіб та причіп (за наявності) для вагового та / або габаритного контролю відповідно до встановленої процедури.",
            'num' => '3',
            'question_id' => '118',
        ]);
        $this->insert('option', [
            'id' => '410',
            'name' => "Виконати всі перелічені вище дії.",
            'num' => '4',
            'question_id' => '118',
        ]);
        $this->insert('option', [
            'id' => '411',
            'name' => "Виконати тільки дії, перелічені у відповідях 1 і 2.",
            'num' => '5',
            'question_id' => '118',
        ]);
        $this->insert('option', [
            'id' => '412',
            'name' => "Тільки на відшкодування витрат у разі надання транспортного засобу працівникам міліції та органу охорони здоров’я.",
            'num' => '1',
            'question_id' => '119',
        ]);
        $this->insert('option', [
            'id' => '413',
            'name' => "Тільки на безпечні та зручні умови для руху.",
            'num' => '2',
            'question_id' => '119',
        ]);
        $this->insert('option', [
            'id' => '414',
            'name' => "Тільки запитувати оперативну інформацію про дорожні умови і напрямки руху.",
            'num' => '3',
            'question_id' => '119',
        ]);
        $this->insert('option', [
            'id' => '415',
            'name' => "На все перелічене вище.",
            'num' => '4',
            'question_id' => '119',
        ]);
        $this->insert('option', [
            'id' => '416',
            'name' => "Тільки на перелічене у відповідях 1 і 2.",
            'num' => '5',
            'question_id' => '119',
        ]);
        $this->insert('option', [
            'id' => '417',
            'name' => "Обгородити місце пригоди.",
            'num' => '1',
            'question_id' => '120',
        ]);
        $this->insert('option', [
            'id' => '418',
            'name' => "Увімкнути аварійну світлову сигналізацію і виставити знак аварійної зупинки.",
            'num' => '2',
            'question_id' => '120',
        ]);
        $this->insert('option', [
            'id' => '419',
            'name' => "Записати дані свідків і скласти схему пригоди.",
            'num' => '3',
            'question_id' => '120',
        ]);
        $this->insert('option', [
            'id' => '420',
            'name' => "Тільки особа, яка навчає водінню.",
            'num' => '1',
            'question_id' => '121',
        ]);
        $this->insert('option', [
            'id' => '421',
            'name' => "Тільки особа, яка навчається водінню.",
            'num' => '2',
            'question_id' => '121',
        ]);
        $this->insert('option', [
            'id' => '422',
            'name' => "Обидві перелічені особи.",
            'num' => '3',
            'question_id' => '121',
        ]);
        $this->insert('option', [
            'id' => '423',
            'name' => "Тій, що має при собі посвідчення на право керування транспортним засобом відповідної категорії.",
            'num' => '1',
            'question_id' => '122',
        ]);
        $this->insert('option', [
            'id' => '424',
            'name' => "Тій, що навчається водінню транспортного засобу.",
            'num' => '2',
            'question_id' => '122',
        ]);
        $this->insert('option', [
            'id' => '425',
            'name' => "Тій, що має при собі будь-яке посвідчення на право керування транспортним засобом.",
            'num' => '3',
            'question_id' => '122',
        ]);
        $this->insert('option', [
            'id' => '426',
            'name' => "Будь-якій, згаданій вище.",
            'num' => '4',
            'question_id' => '122',
        ]);
        $this->insert('option', [
            'id' => '427',
            'name' => "Тільки автомобільних доріг.",
            'num' => '1',
            'question_id' => '123',
        ]);
        $this->insert('option', [
            'id' => '428',
            'name' => "Тільки вулиць та залізничних переїздів.",
            'num' => '2',
            'question_id' => '123',
        ]);
        $this->insert('option', [
            'id' => '429',
            'name' => "Тільки вулиць.",
            'num' => '3',
            'question_id' => '123',
        ]);
        $this->insert('option', [
            'id' => '430',
            'name' => "Автомобільних доріг, вулиць та залізничних переїздів.",
            'num' => '4',
            'question_id' => '123',
        ]);
        $this->insert('option', [
            'id' => '431',
            'name' => "Що знижують тільки швидкість реакції.",
            'num' => '1',
            'question_id' => '124',
        ]);
        $this->insert('option', [
            'id' => '432',
            'name' => "Що знижують тільки увагу.",
            'num' => '2',
            'question_id' => '124',
        ]);
        $this->insert('option', [
            'id' => '433',
            'name' => "Що знижують швидкість реакції та увагу.",
            'num' => '3',
            'question_id' => '124',
        ]);
        $this->insert('option', [
            'id' => '434',
            'name' => "Будь-яких.",
            'num' => '4',
            'question_id' => '124',
        ]);
        $this->insert('option', [
            'id' => '435',
            'name' => "16-річного віку.",
            'num' => '1',
            'question_id' => '125',
        ]);
        $this->insert('option', [
            'id' => '436',
            'name' => "17-річного віку.",
            'num' => '2',
            'question_id' => '125',
        ]);
        $this->insert('option', [
            'id' => '437',
            'name' => "18-річного віку.",
            'num' => '3',
            'question_id' => '125',
        ]);
        $this->insert('option', [
            'id' => '438',
            'name' => "19-річного віку.",
            'num' => '4',
            'question_id' => '125',
        ]);
        $this->insert('option', [
            'id' => '439',
            'name' => "20-річного віку.",
            'num' => '5',
            'question_id' => '125',
        ]);
        $this->insert('option', [
            'id' => '440',
            'name' => "Тільки не забруднювати проїзної частини та смуги відведення автомобільних доріг.",
            'num' => '1',
            'question_id' => '126',
        ]);
        $this->insert('option', [
            'id' => '441',
            'name' => "Тільки повідомляти дорожньо-експлуатаційним організаціям або Державтоінспекції про виявлені факти створення перешкоди для руху.",
            'num' => '2',
            'question_id' => '126',
        ]);
        $this->insert('option', [
            'id' => '442',
            'name' => "Тільки не здійснювати дій, внаслідок яких можуть бути пошкоджені дороги та їх складники.",
            'num' => '3',
            'question_id' => '126',
        ]);
        $this->insert('option', [
            'id' => '443',
            'name' => "Виконувати всі викладені вище обов'язки.",
            'num' => '4',
            'question_id' => '126',
        ]);
        $this->insert('option', [
            'id' => '444',
            'name' => "Виконувати обов'язки, викладені у відповідях 2 і 3.",
            'num' => '5',
            'question_id' => '126',
        ]);
        $this->insert('option', [
            'id' => '445',
            'name' => "Тільки працівника міліції.",
            'num' => '1',
            'question_id' => '127',
        ]);
        $this->insert('option', [
            'id' => '446',
            'name' => "Тільки працівника прокуратури.",
            'num' => '2',
            'question_id' => '127',
        ]);
        $this->insert('option', [
            'id' => '447',
            'name' => "Тільки працівника страхової компанії.",
            'num' => '3',
            'question_id' => '127',
        ]);
        $this->insert('option', [
            'id' => '448',
            'name' => "Будь-якої названої вище особи.",
            'num' => '4',
            'question_id' => '127',
        ]);
        $this->insert('option', [
            'id' => '449',
            'name' => "Працівника міліції або страхової компанії.",
            'num' => '5',
            'question_id' => '127',
        ]);
        $this->insert('option', [
            'id' => '450',
            'name' => "Якщо власник транспортного засобу перебуває в ньому.",
            'num' => '1',
            'question_id' => '128',
        ]);
        $this->insert('option', [
            'id' => '451',
            'name' => "Якщо це стосується тільки навчання водінню відповідно до вимог Правил.",
            'num' => '2',
            'question_id' => '128',
        ]);
        $this->insert('option', [
            'id' => '452',
            'name' => "Якщо особа є найближчим родичем.",
            'num' => '3',
            'question_id' => '128',
        ]);
        $this->insert('option', [
            'id' => '453',
            'name' => "У всіх перелічених вище випадках.",
            'num' => '4',
            'question_id' => '128',
        ]);
        $this->insert('option', [
            'id' => '454',
            'name' => "Дорожньо-експлуатаційну службу.",
            'num' => '1',
            'question_id' => '129',
        ]);
        $this->insert('option', [
            'id' => '455',
            'name' => "Орган або підрозділ міліції.",
            'num' => '2',
            'question_id' => '129',
        ]);
        $this->insert('option', [
            'id' => '456',
            'name' => "Страхову компанію.",
            'num' => '3',
            'question_id' => '129',
        ]);
        $this->insert('option', [
            'id' => '457',
            'name' => "Дозволяється тільки до найближчого населеного пункту.",
            'num' => '1',
            'question_id' => '130',
        ]);
        $this->insert('option', [
            'id' => '458',
            'name' => "Забороняється до отримання в установленому порядку дозволу на проїзд.",
            'num' => '2',
            'question_id' => '130',
        ]);
        $this->insert('option', [
            'id' => '459',
            'name' => "Дозволяється тільки в темну пору доби.",
            'num' => '3',
            'question_id' => '130',
        ]);
        $this->insert('option', [
            'id' => '460',
            'name' => "Будь-якого транспортного засобу під час виклику екстреної служби.",
            'num' => '1',
            'question_id' => '131',
        ]);
        $this->insert('option', [
            'id' => '461',
            'name' => "Будь-якого транспортного засобу під час руху зі швидкістю до 40 км/год.",
            'num' => '2',
            'question_id' => '131',
        ]);
        $this->insert('option', [
            'id' => '462',
            'name' => "Будь-якого транспортного засобу під час прочитання SMS повідомлення.",
            'num' => '3',
            'question_id' => '131',
        ]);
        $this->insert('option', [
            'id' => '463',
            'name' => "Тільки оперативного транспортного засобу під час виконання невідкладного службового завдання.",
            'num' => '4',
            'question_id' => '131',
        ]);
        $this->insert('option', [
            'id' => '464',
            'name' => "Тільки посвідчення на право керування транспортним засобом відповідної категорії.",
            'num' => '1',
            'question_id' => '132',
        ]);
        $this->insert('option', [
            'id' => '465',
            'name' => "Тільки реєстраційний документ на транспортний засіб (технічний талон).",
            'num' => '2',
            'question_id' => '132',
        ]);
        $this->insert('option', [
            'id' => '466',
            'name' => "Тільки поліс (сертифікат) обов’язкового страхування цивільно-правової відповідальності власника наземного транспортного засобу.",
            'num' => '3',
            'question_id' => '132',
        ]);
        $this->insert('option', [
            'id' => '467',
            'name' => "Всі перелічені вище документи.",
            'num' => '4',
            'question_id' => '132',
        ]);
        $this->insert('option', [
            'id' => '468',
            'name' => "Тільки документи, перелічені у відповідях 1 і 2.",
            'num' => '5',
            'question_id' => '132',
        ]);
        $this->insert('option', [
            'id' => '469',
            'name' => "Тільки легкового автомобіля.",
            'num' => '1',
            'question_id' => '133',
        ]);
        $this->insert('option', [
            'id' => '470',
            'name' => "Тільки вантажного мікроавтобуса.",
            'num' => '2',
            'question_id' => '133',
        ]);
        $this->insert('option', [
            'id' => '471',
            'name' => "Тільки вантажного автомобіля.",
            'num' => '3',
            'question_id' => '133',
        ]);
        $this->insert('option', [
            'id' => '472',
            'name' => "Вантажного та легкового автомобілів.",
            'num' => '4',
            'question_id' => '133',
        ]);
        $this->insert('option', [
            'id' => '473',
            'name' => "15-річного віку.",
            'num' => '1',
            'question_id' => '134',
        ]);
        $this->insert('option', [
            'id' => '474',
            'name' => "16-річного віку.",
            'num' => '2',
            'question_id' => '134',
        ]);
        $this->insert('option', [
            'id' => '475',
            'name' => "17-річного віку.",
            'num' => '3',
            'question_id' => '134',
        ]);
        $this->insert('option', [
            'id' => '476',
            'name' => "Тільки алкогольного сп'яніння.",
            'num' => '1',
            'question_id' => '135',
        ]);
        $this->insert('option', [
            'id' => '477',
            'name' => "Тільки під впливом наркотичних речовин.",
            'num' => '2',
            'question_id' => '135',
        ]);
        $this->insert('option', [
            'id' => '478',
            'name' => "Тільки під впливом токсичних речовин.",
            'num' => '3',
            'question_id' => '135',
        ]);
        $this->insert('option', [
            'id' => '479',
            'name' => "Переліченому у відповідях 1—3.",
            'num' => '4',
            'question_id' => '135',
        ]);
        $this->insert('option', [
            'id' => '480',
            'name' => "Переліченому тільки у відповідях 1 і 2.",
            'num' => '5',
            'question_id' => '135',
        ]);
        $this->insert('option', [
            'id' => '481',
            'name' => "Посвідчення на право керування транспортним засобом відповідної категорії.",
            'num' => '1',
            'question_id' => '136',
        ]);
        $this->insert('option', [
            'id' => '482',
            'name' => "Реєстраційний документ на транспортний засіб.",
            'num' => '2',
            'question_id' => '136',
        ]);
        $this->insert('option', [
            'id' => '483',
            'name' => "Поліс (сертифікат) обов'язкового страхування цивільно-правової відповідальності власників наземних транспортних засобів.",
            'num' => '3',
            'question_id' => '136',
        ]);
        $this->insert('option', [
            'id' => '484',
            'name' => "Всі перелічені вище документи.",
            'num' => '4',
            'question_id' => '136',
        ]);
        $this->insert('option', [
            'id' => '485',
            'name' => "Дозволяється.",
            'num' => '1',
            'question_id' => '137',
        ]);
        $this->insert('option', [
            'id' => '486',
            'name' => "Забороняється.",
            'num' => '2',
            'question_id' => '137',
        ]);
        $this->insert('option', [
            'id' => '487',
            'name' => "Роз'їхатися, обмінявшись розписками.",
            'num' => '1',
            'question_id' => '138',
        ]);
        $this->insert('option', [
            'id' => '488',
            'name' => "Прибути до найближчого поста ДАІ або в орган міліції для оформлення матеріалів пригоди, попередньо склавши схему пригоди та поставивши підписи під нею.",
            'num' => '2',
            'question_id' => '138',
        ]);
        $this->insert('option', [
            'id' => '489',
            'name' => "Обмінятися страховими полісами і роз’їхатися.",
            'num' => '3',
            'question_id' => '138',
        ]);
        $this->insert('option', [
            'id' => '490',
            'name' => "Виконати будь-яку з перелічених вище дію.",
            'num' => '4',
            'question_id' => '138',
        ]);
        $this->insert('option', [
            'id' => '491',
            'name' => "18-річного віку.",
            'num' => '1',
            'question_id' => '139',
        ]);
        $this->insert('option', [
            'id' => '492',
            'name' => "19-річного віку.",
            'num' => '2',
            'question_id' => '139',
        ]);
        $this->insert('option', [
            'id' => '493',
            'name' => "20-річного віку.",
            'num' => '3',
            'question_id' => '139',
        ]);
        $this->insert('option', [
            'id' => '494',
            'name' => "21-річного віку.",
            'num' => '4',
            'question_id' => '139',
        ]);
        $this->insert('option', [
            'id' => '495',
            'name' => "22-річного віку.",
            'num' => '5',
            'question_id' => '139',
        ]);
        $this->insert('option', [
            'id' => '496',
            'name' => "Звільнити проїзну частину.",
            'num' => '1',
            'question_id' => '140',
        ]);
        $this->insert('option', [
            'id' => '497',
            'name' => "Вжити можливих заходів для надання першої медичної допомоги постраждалим.",
            'num' => '2',
            'question_id' => '140',
        ]);
        $this->insert('option', [
            'id' => '498',
            'name' => "Повідомити про дорожньо-транспортну пригоду в міліцію.",
            'num' => '3',
            'question_id' => '140',
        ]);
        $this->insert('option', [
            'id' => '499',
            'name' => "Записати прізвища та адреси очевидців.",
            'num' => '4',
            'question_id' => '140',
        ]);
        $this->insert('option', [
            'id' => '500',
            'name' => "Товарно-транспортний документ на небезпечний вантаж.",
            'num' => '1',
            'question_id' => '141',
        ]);
        $this->insert('option', [
            'id' => '501',
            'name' => "Тільки свідоцтво про допуск водія до перевезення.",
            'num' => '2',
            'question_id' => '141',
        ]);
        $this->insert('option', [
            'id' => '502',
            'name' => "Тільки свідоцтво про допуск транспортного засобу до перевезення.",
            'num' => '3',
            'question_id' => '141',
        ]);
        $this->insert('option', [
            'id' => '503',
            'name' => "Тільки узгодження маршруту дорожнього перевезення.",
            'num' => '4',
            'question_id' => '141',
        ]);
        $this->insert('option', [
            'id' => '504',
            'name' => "Усі перелічені вище документи.",
            'num' => '5',
            'question_id' => '141',
        ]);
        $this->insert('option', [
            'id' => '505',
            'name' => "Не зареєстрованим у Державтоінспекції.",
            'num' => '1',
            'question_id' => '142',
        ]);
        $this->insert('option', [
            'id' => '506',
            'name' => "Без номерного знака або який закріплено не у встановленому для цього місці.",
            'num' => '2',
            'question_id' => '142',
        ]);
        $this->insert('option', [
            'id' => '507',
            'name' => "Без знака про укладення договору страхування цивільно-правової відповідальності власників наземних транспортних засобів.",
            'num' => '3',
            'question_id' => '142',
        ]);
        $this->insert('option', [
            'id' => '508',
            'name' => "У випадках, викладених у відповідях 1 і 2.",
            'num' => '4',
            'question_id' => '142',
        ]);
        $this->insert('option', [
            'id' => '509',
            'name' => "У випадках, викладених у відповідях 1-3.",
            'num' => '5',
            'question_id' => '142',
        ]);
        $this->insert('option', [
            'id' => '510',
            'name' => "Перевірити тільки технічний стан транспортного засобу і комплектність документів, подати сигнали світловими покажчиками.",
            'num' => '1',
            'question_id' => '143',
        ]);
        $this->insert('option', [
            'id' => '511',
            'name' => "Перевірити лише правильність розміщення вантажу, наявність документів, увімкнути ближнє світло або протитуманні фари.",
            'num' => '2',
            'question_id' => '143',
        ]);
        $this->insert('option', [
            'id' => '512',
            'name' => "Перевірити і забезпечити технічно справний стан і комплектність транспортного засобу, правильність розміщення та кріплення вантажу.",
            'num' => '3',
            'question_id' => '143',
        ]);
        $this->insert('option', [
            'id' => '513',
            'name' => "Виконати тільки дії, перелічені у відповідях 1 і 2.",
            'num' => '4',
            'question_id' => '143',
        ]);
        $this->insert('option', [
            'id' => '514',
            'name' => "Тільки для переслідування правопорушників і доставлення їх до міліції.",
            'num' => '1',
            'question_id' => '144',
        ]);
        $this->insert('option', [
            'id' => '515',
            'name' => "Тільки для транспортування пошкоджених транспортних засобів (вантажних автомобілів).",
            'num' => '2',
            'question_id' => '144',
        ]);
        $this->insert('option', [
            'id' => '516',
            'name' => "Тільки для відправлення водія на медичний огляд для визначення стану алкогольного сп'яніння.",
            'num' => '3',
            'question_id' => '144',
        ]);
        $this->insert('option', [
            'id' => '517',
            'name' => "У всіх перелічених вище випадках.",
            'num' => '4',
            'question_id' => '144',
        ]);
        $this->insert('option', [
            'id' => '518',
            'name' => "У випадках, перелічених у відповідях 1 і 2, а також для доставлення до найближчого лікувального закладу осіб, які потребують невідкладної медичної допомоги.",
            'num' => '5',
            'question_id' => '144',
        ]);
        $this->insert('option', [
            'id' => '519',
            'name' => "Знати причину зупинки, перевірки та огляду транспортного засобу посадовою особою державного органу, що здійснює нагляд за дорожнім рухом, а також її прізвище і посаду.",
            'num' => '1',
            'question_id' => '145',
        ]);
        $this->insert('option', [
            'id' => '520',
            'name' => "Вимагати від особи, яка здійснює нагляд за дорожнім рухом і зупинила транспортний засіб, пред’явлення посвідчення його особи.",
            'num' => '2',
            'question_id' => '145',
        ]);
        $this->insert('option', [
            'id' => '521',
            'name' => "Одержувати необхідну допомогу від посадових осіб та організацій, що беруть участь у забезпеченні безпеки дорожнього руху.",
            'num' => '3',
            'question_id' => '145',
        ]);
        $this->insert('option', [
            'id' => '522',
            'name' => "Оскаржити дії працівника міліції в разі порушення ним законодавства.",
            'num' => '4',
            'question_id' => '145',
        ]);
        $this->insert('option', [
            'id' => '523',
            'name' => "На все, перелічене у відповідях.",
            'num' => '5',
            'question_id' => '145',
        ]);
        $this->insert('option', [
            'id' => '524',
            'name' => "Тільки зеленого кольору.",
            'num' => '1',
            'question_id' => '146',
        ]);
        $this->insert('option', [
            'id' => '525',
            'name' => "Тільки червоного кольору.",
            'num' => '2',
            'question_id' => '146',
        ]);
        $this->insert('option', [
            'id' => '526',
            'name' => "Обидва порушують.",
            'num' => '3',
            'question_id' => '146',
        ]);
        $this->insert('option', [
            'id' => '527',
            'name' => "Обидва не порушують.",
            'num' => '4',
            'question_id' => '146',
        ]);
        $this->insert('option', [
            'id' => '528',
            'name' => "Зобов’язаний тільки на посту Державтоінспекції.",
            'num' => '1',
            'question_id' => '147',
        ]);
        $this->insert('option', [
            'id' => '529',
            'name' => "Зобов’язаний проїхати у відділення міліції.",
            'num' => '2',
            'question_id' => '147',
        ]);
        $this->insert('option', [
            'id' => '530',
            'name' => "Зобов’язаний.",
            'num' => '3',
            'question_id' => '147',
        ]);
        $this->insert('option', [
            'id' => '531',
            'name' => "Не зобов’язаний.",
            'num' => '4',
            'question_id' => '147',
        ]);
        $this->insert('option', [
            'id' => '532',
            'name' => "Зобов’язаний надати можливість перевірити лише номери агрегатів.",
            'num' => '5',
            'question_id' => '147',
        ]);
        $this->insert('option', [
            'id' => '533',
            'name' => "Уповноваженої посадової особи Державтоінспекції.",
            'num' => '1',
            'question_id' => '148',
        ]);
        $this->insert('option', [
            'id' => '534',
            'name' => "Представника страхової компанії або аварійного комісара.",
            'num' => '2',
            'question_id' => '148',
        ]);
        $this->insert('option', [
            'id' => '535',
            'name' => "Уповноваженої особи підприємства (організації).",
            'num' => '3',
            'question_id' => '148',
        ]);
        $this->insert('option', [
            'id' => '536',
            'name' => "Будь-якої названої вище особи.",
            'num' => '4',
            'question_id' => '148',
        ]);
        $this->insert('option', [
            'id' => '537',
            'name' => "1.	Тільки довіряти в установленому порядку користуватися або розпоряджатися транспортним засобом іншій особі.",
            'num' => '1',
            'question_id' => '149',
        ]);
        $this->insert('option', [
            'id' => '538',
            'name' => "Тільки на відшкодування витрат у разі надання транспортного засобу працівникові органу охорони здоров'я для доставлення до лікувального закладу потерпілого під час дорожньо-транспортної пригоди.",
            'num' => '2',
            'question_id' => '149',
        ]);
        $this->insert('option', [
            'id' => '539',
            'name' => "Користуватися всіма переліченими вище правами.",
            'num' => '3',
            'question_id' => '149',
        ]);
        $this->insert('option', [
            'id' => '540',
            'name' => "У світлу пору доби вмикати ближнє світло фари.",
            'num' => '1',
            'question_id' => '150',
        ]);
        $this->insert('option', [
            'id' => '541',
            'name' => "Бути в застебнутому мотошоломі й не перевозити пасажирів без застебнутих мотошоломів.",
            'num' => '2',
            'question_id' => '150',
        ]);
        $this->insert('option', [
            'id' => '542',
            'name' => "Виїжджати на крайню ліву смугу проїзної частини тільки для об’їзду перешкоди або повороту ліворуч.",
            'num' => '3',
            'question_id' => '150',
        ]);
        $this->insert('option', [
            'id' => '543',
            'name' => "Зафіксувати розташування слідів пригоди і положення транспортного засобу після його зупинки, відвезти потерпілих до найближчої лікувальної установи і повернутися на місце пригоди.",
            'num' => '1',
            'question_id' => '151',
        ]);
        $this->insert('option', [
            'id' => '544',
            'name' => "Негайно відвезти потерпілих до лікувального закладу і повернутися на місце пригоди.",
            'num' => '2',
            'question_id' => '151',
        ]);
        $this->insert('option', [
            'id' => '545',
            'name' => "Тільки водіям-інвалідам.",
            'num' => '1',
            'question_id' => '152',
        ]);
        $this->insert('option', [
            'id' => '546',
            'name' => "Тільки водіям і пасажирам оперативних та спеціальних транспортних засобів і таксі.",
            'num' => '2',
            'question_id' => '152',
        ]);
        $this->insert('option', [
            'id' => '547',
            'name' => "Тільки особі, яка навчає водінню в транспортному засобі, якщо за кермом учень.",
            'num' => '3',
            'question_id' => '152',
        ]);
        $this->insert('option', [
            'id' => '548',
            'name' => "Усім названим вище особам.",
            'num' => '4',
            'question_id' => '152',
        ]);
        $this->insert('option', [
            'id' => '549',
            'name' => "Тільки червоного автомобіля.",
            'num' => '1',
            'question_id' => '153',
        ]);
        $this->insert('option', [
            'id' => '550',
            'name' => "Тільки синього автомобіля.",
            'num' => '2',
            'question_id' => '153',
        ]);
        $this->insert('option', [
            'id' => '551',
            'name' => "Обидва порушили.",
            'num' => '3',
            'question_id' => '153',
        ]);
        $this->insert('option', [
            'id' => '552',
            'name' => "Обидва не порушили",
            'num' => '4',
            'question_id' => '153',
        ]);
        $this->insert('option', [
            'id' => '553',
            'name' => "Тільки бути уважним, стежити за дорожньою обстановкою і відповідно реагувати на її зміну.",
            'num' => '1',
            'question_id' => '154',
        ]);
        $this->insert('option', [
            'id' => '554',
            'name' => "Тільки стежити за правильністю розташування і кріплення вантажу.",
            'num' => '2',
            'question_id' => '154',
        ]);
        $this->insert('option', [
            'id' => '555',
            'name' => "Тільки стежити за технічним станом транспортного засобу і не відволікатися від керування ним у дорозі.",
            'num' => '3',
            'question_id' => '154',
        ]);
        $this->insert('option', [
            'id' => '556',
            'name' => "Виконувати всі перелічені вище вимоги.",
            'num' => '4',
            'question_id' => '154',
        ]);
        $this->insert('option', [
            'id' => '557',
            'name' => "Виконувати тільки перелічені у відповідях 1 і 2 вимоги.",
            'num' => '5',
            'question_id' => '154',
        ]);
        $this->insert('option', [
            'id' => '558',
            'name' => "Тільки при відсутності травмованих (загиблих) людей.",
            'num' => '1',
            'question_id' => '155',
        ]);
        $this->insert('option', [
            'id' => '559',
            'name' => "Тільки при досягненні згоди щодо обставин скоєння дорожньо-транспортної пригоди.",
            'num' => '2',
            'question_id' => '155',
        ]);
        $this->insert('option', [
            'id' => '560',
            'name' => "Тільки при складанні водіями спільного повідомлення про дорожньо-транспортну пригоду відповідно до встановленого Моторним (транспортним) страховим бюро зразком.",
            'num' => '3',
            'question_id' => '155',
        ]);
        $this->insert('option', [
            'id' => '561',
            'name' => "Тільки при відсутності у водіїв ознак алкогольного, наркотичного чи іншого сп'яніння або перебування під впливом лікарських препаратів, що знижують увагу та швидкість реакції.",
            'num' => '4',
            'question_id' => '155',
        ]);
        $this->insert('option', [
            'id' => '562',
            'name' => "При виконанні всіх перелічених вище умов.",
            'num' => '5',
            'question_id' => '155',
        ]);
        $this->insert('option', [
            'id' => '563',
            'name' => "Не належить цьому засобу.",
            'num' => '1',
            'question_id' => '156',
        ]);
        $this->insert('option', [
            'id' => '564',
            'name' => "У темний час доби не освітлений.",
            'num' => '2',
            'question_id' => '156',
        ]);
        $this->insert('option', [
            'id' => '565',
            'name' => "Закріплений не в установленому для цього місці.",
            'num' => '3',
            'question_id' => '156',
        ]);
        $this->insert('option', [
            'id' => '566',
            'name' => "Закритий іншими предметами чи забруднений, що не дає можливості розпізнати символи з відстані 20 м.",
            'num' => '4',
            'question_id' => '156',
        ]);
        $this->insert('option', [
            'id' => '567',
            'name' => "Підпадає під будь-яку з перелічених вимогу.",
            'num' => '5',
            'question_id' => '156',
        ]);
    }

    public function down()
    {
        $query = (new Query())->select('id')->from('question')->where(['chapter_id' => 2])->all();
        $questionIDs = [];
        foreach ($query as $key => $val) {
            $questionIDs[] = $val['id'];
        }
        $this->delete('option', ['in', 'question_id', $questionIDs]);
    }
}
