<?php

use yii\db\Schema;
use yii\db\Migration;

class m150407_153240_populate_chapter12_question_table extends Migration
{
    public function up()
    {
        $this->insert('question', [
            'id' => '657',
            'name' => "С какой максимальной скоростью разрешается движение водителю легкового автомобиля после проезда перекрестка?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '1',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '658',
            'name' => "С какой максимальной скоростью разрешается движение мотоцикла на автомагистрали, если его водитель имеет водительский стаж 3 года?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '2',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '659',
            'name' => "С какой максимальной скоростью разрешается движение легковому автомобилю в населенном пункте, обозначенном этим знаком?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '3',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '660',
            'name' => "Водителю какого транспортного средства разрешается движение со скоростью 90 км/ч на этом участке дороги?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '4',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '661',
            'name' => "Водитель какого транспортного средства не нарушает Правила, двигаясь со скоростью 20 км/ч?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '5',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '662',
            'name' => "В этом случае максимальная скорость движения грузового автомобиля не должна превышать:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '6',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '663',
            'name' => "С какой максимальной скоростью разрешается продолжить движение водителю легкового автомобиля после проезда этого дорожного знака?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '7',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '664',
            'name' => "С какой максимальной скоростью разрешается движение водителю грузового автомобиля на этом участке дороги?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '8',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '665',
            'name' => "С какой максимальной скоростью разрешается буксировка механическим транспортным средством?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '9',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '666',
            'name' => "Водители каких транспортных средств нарушают Правила, двигаясь со скоростью 90 км/ч?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '10',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '667',
            'name' => "С какой максимальной скоростью разрешается движение водителю микроавтобуса в этом случае?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '11',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '668',
            'name' => "Разрешается ли водителю автобуса междугородного сообщения двигаться со скоростью более 90 км/ч на этом участке дороги?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '12',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '669',
            'name' => "На каком участке дороги водителю мотоцикла запрещается движение со скоростью 80 км/ч?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '13',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '670',
            'name' => "С какой скоростью разрешается движение грузового автомобиля на этом участке дороги?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '14',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '671',
            'name' => "Водителю какого транспортного средства разрешается превышать установленные Правилами ограничения скорости движения?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '15',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '672',
            'name' => "С какой максимальной скоростью разрешается такое движение?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '16',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '673',
            'name' => "При приближении к участку дороги, о котором информирует изображенный на рисунке дорожный знак, водитель должен вести транспортное средство со скоростью:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '17',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '674',
            'name' => "С какой максимальной скоростью разрешается движение мотоциклисту в этом населенном пункте?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '18',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '675',
            'name' => "С какой максимальной скоростью разрешается движение грузовым автомобилям на дороге для автомобилей, проходящей через населенный пункт, обозначенный знаком 5.47 (начало населенного пункта на синем фоне)?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '19',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '676',
            'name' => "Разрешается ли водителю легкового автомобиля выполнить опережение мотоцикла, движущегося со скоростью 80 км/ч?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '20',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '677',
            'name' => "В каких случаях водителю легкового автомобиля разрешается движение со скоростью до 70 км/ч в населенном пункте?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '21',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '678',
            'name' => "С какой максимальной скоростью разрешается движение водителю легкового автомобиля после поворота налево?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '22',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '679',
            'name' => "Водитель какого транспортного средства нарушает Правила, двигаясь со скоростью 90 км/ч?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '23',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '680',
            'name' => "С какой максимальной скоростью разрешается движение водителю микроавтобуса на этом участке дороги?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '24',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '681',
            'name' => "Водитель какого транспортного средства нарушает требования Правил, двигаясь по левой полосе со скоростью 80 км/ч?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '25',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '682',
            'name' => "Разрешается ли водителю автомобиля движение со скоростью 70 км/ч после проезда места, где расположены дорожные знаки?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '26',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '683',
            'name' => "Водитель какого транспортного средства не нарушает Правила, двигаясь со скоростью 60 км/ч?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '27',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '684',
            'name' => "С какой максимальной скоростью разрешается движение водителю автомобиля с включенными маячками на этом участке дороги?",
            'correct_option' => '5',
            'rule_reference' => '',
            'num' => '28',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '685',
            'name' => "С какой максимальной скоростью разрешается движение грузовым автомобилям с прицепом вне населенных пунктов на дорогах без разделительной полосы и которые не отнесены к автомагистралям или дорогам для автомобилей?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '29',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '686',
            'name' => "С какой максимальной скоростью разрешается движение водителю мопеда в населенном пункте, обозначенном этим знаком?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '30',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '687',
            'name' => "С какой максимальной скоростью разрешается движение автобуса, обозначенного этим знаком?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '31',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '688',
            'name' => "С какой максимальной скоростью разрешается движение легковому автомобилю в населенном пункте, обозначенном этим знаком?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '32',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '689',
            'name' => "С какой максимальной скоростью разрешается движение водителю легкового автомобиля после поворота направо?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '33',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '690',
            'name' => "С какой максимальной скоростью разрешается движение водителю легкового автомобиля на этой дороге?",
            'correct_option' => '5',
            'rule_reference' => '',
            'num' => '34',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '691',
            'name' => "При выборе безопасной скорости движения транспортного средства водитель должен учитывать:",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '35',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '692',
            'name' => "Разрешается ли водителю без необходимости движение с очень малой скоростью?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '36',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '693',
            'name' => "Грузовому автомобилю, буксирующему легковой автомобиль, разрешается движение в населенном пункте со скоростью не более:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '37',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '694',
            'name' => "В жилых и пешеходных зонах скорость движения транспортных средств не должна превышать:",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '38',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '695',
            'name' => "Водителю какого транспортного средства разрешается движение со скоростью 90 км/ч?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '39',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '696',
            'name' => "С какой максимальной скоростью разрешается движение мотоциклисту со стажем 3 года на этой дороге?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '40',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '697',
            'name' => "В случае возникновения препятствия для движения, которое водитель объективно способен обнаружить, он должен немедленно принять меры:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '41',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '698',
            'name' => "С какой максимальной скоростью разрешается движение водителю грузового автомобиля с разрешенной максимальной массой более 3,5 т после поворота направо?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '42',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '699',
            'name' => "На каком из обозначенных на рисунке участке дороги разрешается Вам движение на легковом автомобиле со скоростью 60 км/ч?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '43',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '700',
            'name' => "С какой максимальной скоростью разрешается движение легковому автомобилю на этом участке дороги?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '44',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '701',
            'name' => "С какой максимальной скоростью разрешается движение легковым автомобилям с прицепом на автомагистрали?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '45',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '702',
            'name' => "Управляя автобусом, после проезда места, гдо установлен изображенный на рисунке дорожный знак, Вам разрешается продолжить движение с максимальной скоростью:",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '46',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '703',
            'name' => "С какой максимальной скоростью разрешается движение транспортных средств по проезжей части на обозначенной этим дорожным знаком территории?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '47',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '704',
            'name' => "Водителю какого из перечисленных в ответах транспортного средства разрешается движение по левой полосе?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '48',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '705',
            'name' => "С какой максимальной скоростью вам разрешается двигаться после проезда места, где установлены эти дорожные знаки, если ваш водительский стаж составляет 1,5 года?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '49',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '706',
            'name' => "С какой максимальной скоростью разрешается движение транспортных средств после проезда этого дорожного знака?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '50',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '707',
            'name' => "Водитель какого транспортного средства нарушает Правила, двигаясь со скоростью 100 км/ч по этой дороге в населенном пункте, обозначенном знаком 5.47 (на синем фоне)?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '51',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '708',
            'name' => "С какой максимальной скоростью разрешается движение грузового автомобиля, перевозящего людей в кузове, на дороге вне населенного пункта?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '52',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '709',
            'name' => "С какой максимальной скоростью водителю легкового автомобиля разрешается продолжить движение по правой полосе после проезда места расположения дорожного знака над левой полосой?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '53',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '710',
            'name' => "Водитель какого транспортного средства нарушает Правила, в том числе и двигаясь со скоростью 130 км/ч?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '54',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '711',
            'name' => "С какой максимальной скоростью разрешается Вам движение на легковом автомобиле до пересечения проезжих частей?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '55',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '712',
            'name' => "На управляемом вами автомобиле установлен опознавательный знак с числом 50. С какой максимальной скоростью вам разрешается двигаться после проезда этого дорожного знака?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '56',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '713',
            'name' => "Разрешается ли Правилами превышать максимальную скорость движения, определенную технической характеристикой транспортного средства?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '57',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '714',
            'name' => "С какой максимальной скоростью разрешается движение водителю легкового автомобиля с прицепом на этом участке дороги?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '58',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '715',
            'name' => "Разрешается ли водителю мотоцикла начать опережение микроавтобуса, скорость движения которого 80 км/ч?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '59',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '716',
            'name' => "С какой максимальной скоростью разрешается Вам движение в населенном пункте после проезда этого знака?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '60',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '717',
            'name' => "С какой максимальной скоростью разрешается движение в населенном пункте на этой дороге?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '61',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '718',
            'name' => "Водителю какого грузового автомобиля разрешается движение со скоростью 100 км/ч?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '62',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '719',
            'name' => "С какой максимальной скоростью разрешается движение водителю автомобиля после проезда этого дорожного знака?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '63',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '720',
            'name' => "Водителю какого транспортного средства разрешается двигаться со скоростью 110 км/ч?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '64',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '721',
            'name' => "С какой максимальной скоростью разрешается Вам движение после проезда дорожного знака?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '65',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '722',
            'name' => "Кто из водителей транспортных средств нарушает Правила, двигаясь со скоростью 100 км/ч?",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '66',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '723',
            'name' => "С какой максимальной скоростью разрешается движение водителю автомобиля после проезда этого знака?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '67',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '724',
            'name' => "С какой максимальной скоростью разрешается движение водителю легкового автомобиля с прицепом на этом участке дороги?",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '68',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '725',
            'name' => "Разрешается ли коме-либо из водителей движение на этом участке дороги со скоростью 110 км/ч?",
            'correct_option' => '4',
            'rule_reference' => '',
            'num' => '69',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '726',
            'name' => "С какой максимальной скоростью разрешается Вам движение на этом участке дороги, если Ваш стаж водителя 1 год?",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '70',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '727',
            'name' => "",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '71',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '728',
            'name' => "",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '72',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '729',
            'name' => "",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '73',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '730',
            'name' => "",
            'correct_option' => '2',
            'rule_reference' => '',
            'num' => '74',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '731',
            'name' => "",
            'correct_option' => '1',
            'rule_reference' => '',
            'num' => '75',
            'chapter_id' => '12',
        ]);
        $this->insert('question', [
            'id' => '732',
            'name' => "",
            'correct_option' => '3',
            'rule_reference' => '',
            'num' => '76',
            'chapter_id' => '12',
        ]);
    }

    public function down()
    {
        $this->delete('question', ['chapter_id' => '12']);
    }
}
